{
  "s": 1,
  "d": [
    {
      "id": "371",
      "Title": "Chinese Broccoli With Soy Paste",
      "Ingredients": {
        "1": "1 lb. Chinese broccoli or broccolini, trimmed, cut in thirds crosswise",
        "2": "¼ cup soy paste (such as Yu Ding Xing)"
      },
      "Instructions": "Set a steamer basket in a large pot filled with 1\" water, cover pot, and bring water to a boil. Add broccoli to steamer basket, cover pot, and steam broccoli until crisp-tender, about 5 minutes.\nMeanwhile, whisk soy paste and 2 Tbsp. water in a large bowl.\nArrange broccoli on a platter and drizzle sauce over.",
      "Image": "//20fix.com/xfood/img/chinese-broccoli-with-soy-paste.jpg"
    },
    {
      "id": "1400",
      "Title": "Chinese Five-Spice Steak with Oranges and Sesame Broccolini",
      "Ingredients": {
        "1": "3 small oranges (about 1 lb.)",
        "2": "1 1/2 tsp. Chinese five-spice powder",
        "3": "1 tsp. light brown sugar",
        "4": "2 1/4 tsp. kosher salt, divided",
        "5": "1 hanger steak (about 1 1/4 lb.), cut in half lengthwise, center gristle removed",
        "6": "2 Tbsp. vegetable oil",
        "7": "3 bunches broccolini (about 1 1/2 lb.), trimmed, halved lengthwise if large",
        "8": "2 Tbsp. toasted sesame oil",
        "9": "1/2 tsp. crushed red pepper flakes",
        "10": "1 tsp. toasted sesame seeds, plus more for serving",
        "11": "3 scallions, thinly sliced",
        "12": "Flaky sea salt",
        "13": "Steamed rice and hot sauce (for serving; optional)"
      },
      "Instructions": "Finely grate 2 tsp. orange zest from 1 orange into a small bowl. Cut all oranges in half; set aside.\nAdd five-spice powder, brown sugar, and 2 tsp. kosher salt to bowl with zest and stir to combine. Rub steak all over with spice mixture.\nHeat vegetable oil in a large heavy skillet (preferably cast iron) over high. Cook steak, turning often, until browned on all sides and an instant-read thermometer inserted into the center registers 130˚F for medium-rare, 15–20 minutes total. After steak has cooked for about 5 minutes, nestle orange halves cut side down around steak and cook until well browned, about 5 minutes. Transfer oranges to a plate. Transfer steak to a cutting board and let rest 10 minutes before slicing.\nArrange broccolini in an even layer in same skillet and heat over high. Cook, undisturbed, until well charred, about 3 minutes. Toss and continue to cook until tender and slightly charred all over, about 3 minutes more. Transfer to a large bowl. Squeeze in juice from 2 orange halves over. Add sesame oil, red pepper flakes, 1 tsp. sesame seeds, and remaining 1/4 tsp. kosher salt and toss to coat.\nTransfer steak to a platter. Arrange broccolini mixture alongside. Top with scallions, sea salt, and remaining sesame seeds. Serve with charred orange halves to squeeze over, rice, and hot sauce alongside, if desired.",
      "Image": "//20fix.com/xfood/img/chinese-five-spice-steak-with-oranges-and-sesame-broccolini.jpg"
    },
    {
      "id": "4226",
      "Title": "Sticky Rice Stuffing with Chinese Sausage and Shiitakes",
      "Ingredients": {
        "1": "2 1/2 cups Thai long grain sticky rice, or regular short-grain sticky rice",
        "2": "1/3 cup pine nuts",
        "3": "1/4 cup vegetable oil",
        "4": "2 large shallots, sliced into 1/4\" rings",
        "5": "1/2 pound shiitakes mushrooms, stemmed and coarsely chopped",
        "6": "6 ounces Chinese sausage (about 4 links), sliced (about 1 1/2 cups)",
        "7": "1/4 cup Shaoxing Chinese wine or dry sherry",
        "8": "3 tablespoons soy sauce",
        "9": "1 cup jarred peeled roasted chestnuts, roughly chopped",
        "10": "2 1/2 cups low-sodium chicken broth or water",
        "11": "Kosher salt",
        "12": "2 scallions, thinly sliced, for garnish",
        "13": "12-inch cast iron skillet"
      },
      "Instructions": "Rinse the rice in a colander, and then transfer to a medium bowl. Cover with 1 inch of water and let soak at room temperature overnight. Drain thoroughly.\nHeat a large cast iron skillet over medium heat. Add the pine nuts and toast, stirring, until golden, 3 to 4 minutes. Transfer to a plate and set aside, reserving skillet.\nReturn skillet to medium heat and add oil. When oil is hot, add the shallots and mushrooms and cook, stirring, until the shallots are golden brown, 3 to 4 minutes. Add the sausage and cook until the sausages curl slightly, 1 minute more. Add the sherry, bring to a boil, and cook until syrupy, about 1 minute. Add the soy sauce, chestnuts, rice, and toasted pine nuts and toss until the rice kernels are evenly coated. Stir in the broth or water and season with salt. Cover and simmer over medium-low heat until the rice is cooked, 20 to 25 minutes.\nGarnish rice \"stuffing\" with sliced scallions before serving.",
      "Image": "//20fix.com/xfood/img/sticky-rice-stuffing-with-chinese-sausage-and-shiitakes-51252600.jpg"
    },
    {
      "id": "5507",
      "Title": "Chinese Orange Chicken",
      "Ingredients": {
        "1": "1 pound boneless, skinless chicken thighs, patted dry and cut into 1 1/2-inch pieces",
        "2": "1 teaspoon soy sauce",
        "3": "1 teaspoon Chinese Shaoxing wine or dry sherry",
        "4": "1/2 cup cornstarch",
        "5": "About 2 cups canola oil for frying",
        "6": "2 oranges",
        "7": "2 teaspoons cornstarch",
        "8": "1 tablespoon canola oil",
        "9": "2 cloves garlic, minced",
        "10": "2 teaspoons minced peeled fresh ginger (from 1-inch piece)",
        "11": "1/8 to 1/4 teaspoon crushed red pepper",
        "12": "1 tablespoon low-sodium soy sauce",
        "13": "1 teaspoon Chinese Shaoxing wine or dry sherry",
        "14": "1 teaspoon rice vinegar (not seasoned) or cider vinegar",
        "15": "2 tablespoons sugar",
        "16": "Thinly sliced scallion greens, for garnish",
        "17": "Thinly sliced fresh red chile, for garnish (optional)",
        "18": "Cooked rice for serving",
        "19": "Equipment: 10-inch cast-iron skillet or other high-sided skillet (at least 2 inches deep), deep-fry thermometer, Microplane (for optional garnish)"
      },
      "Instructions": "In a shallow, medium bowl toss the chicken pieces with the soy sauce and wine. Let stand while you make the sauce.\nUsing a vegetable peeler, remove 4 lengthwise strips of zest from 1 orange—each strip should be about 3/4 inch wide and 3 1/2 to 4 inches long. Arrange the zest in one layer between paper towels and microwave on high in 20-second increments until dry and brittle but not browned, 60 to 80 seconds total. Let the zest cool then finely chop it. If desired, use a Microplane to remove some of the remaining zest from the orange and reserve it for garnish. (If desired, zest the second orange for additional garnish.)\nSqueeze enough juice from both oranges to measure 1/2 cup. In a small bowl, whisk together the juice and 2 teaspoons cornstarch until the cornstarch is dissolved.\nIn a 10-inch skillet, heat 1 tablespoon oil over moderate heat until hot but not smoking. Add the garlic, ginger, crushed red pepper, and dried orange zest and stir-fry until golden, about 30 seconds. Add the soy sauce, wine, vinegar, and sugar and stir until the sugar dissolves, about 5 seconds. Stir the orange juice–cornstarch mixture then add it to the skillet. Bring the sauce to a boil, stirring, then reduce the heat to low and simmer, uncovered, for 1 minute. Remove the skillet from the heat and set it aside while you fry the chicken.\nLine a large rimmed baking sheet with paper towels.\nIn a 10-inch cast-iron skillet, heat 1/2 inch of oil until a deep-fry thermometer registers 365°F. Meanwhile, coat half of the chicken, a couple pieces at a time, in cornstarch, making sure they are well coated and gently knocking off any excess, then transfer to a plate. Carefully add all the coated chicken to the hot oil, spacing the pieces apart from each other. Fry the chicken, turning it once or twice, until deep golden, about 5 minutes. While frying, adjust the heat as necessary to keep the oil at 365°F. Using a metal spider or a slotted spoon, transfer the chicken as done to the paper-towel-lined baking sheet. Continue to coat and fry the remaining chicken in the same manner, returning the oil to 365°F between batches.\nOnce the chicken is fried, place the skillet of reserved orange sauce over moderately low heat and bring it to a simmer, stirring and thinning the sauce with a little water if necessary. Add the chicken, and stir until thoroughly coated in sauce.\nTransfer the chicken to a serving dish and garnish with the scallions, and, if desired, the red chile slices and the freshly grated orange zest. Serve immediately with rice.",
      "Image": "//20fix.com/xfood/img/chinese-orange-chicken-51168000.jpg"
    },
    {
      "id": "5673",
      "Title": "Chinese Butter Cookies",
      "Ingredients": {
        "1": "12 tablespoons (1 1/2 sticks) unsalted butter, softened', \"3/4 cup confectioners' sugar\", '1 large egg",
        "2": "1/2 teaspoon pure vanilla extract",
        "3": "1 1/2 cups self-rising flour",
        "4": "Mixer with paddle attachment",
        "5": "Cookie press"
      },
      "Instructions": "1. Preheat the oven to 375°F. Line a baking sheet with parchment paper.\n2. In a standing electric mixer, cream the butter until smooth. Add the confectioners' sugar and cream until fluffy. Add the egg and vanilla extract. Slowly sift in the self-rising flour and beat until a smooth dough forms.\n3. Add the dough to a cookie press and attach a star or flower-shape disk. Press the cookies onto the lined baking sheet, leaving 1 inch of space around each cookie.\n4. Bake for 15 minutes, or until lightly golden on top. Transfer to a wire rack to cool completely before storing. The cookies can be stored at room temperature in an airtight container for 3 to 4 days.",
      "Image": "//20fix.com/xfood/img/chinese-butter-cookies-51149800.jpg"
    },
    {
      "id": "6461",
      "Title": "Chinese Trinidadian Stir-Fried Shrimp with Rum",
      "Ingredients": {
        "1": "1 pound large shrimp",
        "2": "Juice of 1/2 lime",
        "3": "3 tablespoons ketchup",
        "4": "3 tablespoons dark Jamaican rum",
        "5": "2 teaspoons soy sauce",
        "6": "1/4 teaspoon ground white pepper",
        "7": "2 tablespoons peanut or vegetable oil",
        "8": "1 tablespoon minced garlic",
        "9": "1 tablespoon minced ginger",
        "10": "1/2 teaspoon salt",
        "11": "1 medium ripe tomato, cut into thin wedges",
        "12": "1 large green bell pepper, cut into thin strips",
        "13": "1 small onion, cut into thin wedges",
        "14": "1 tablespoon finely chopped cilantro"
      },
      "Instructions": "1. Using kitchen shears, cut through the shrimp shells two-thirds of the length down the back of the shrimp. Remove the legs and devein the shrimp, leaving the shells and tails on. In a medium bowl toss the shrimp with the lime juice for a few seconds. Rinse the shrimp, drain, and set on a plate lined with paper towels. With more paper towels pat the shrimp dry. In a small bowl combine the ketchup, rum, soy sauce, and ground white pepper.\n2. Heat a 14-inch flat-bottomed wok or 12-inch skillet over high heat until a bead of water vaporizes within 1 to 2 seconds of contact. Swirl in the oil, add the garlic and ginger, then, using a metal spatula, stir-fry 10 seconds or until the aromatics are fragrant. Push the aromatics to the sides of the wok, carefully add the shrimp and spread them evenly in one layer in the wok. Cook undisturbed 1 minute, letting the shrimp begin to sear. Sprinkle on the salt and stir-fry 30 seconds or until the shrimp begin to turn orange. Add the tomatoes, bell peppers, and onions and stir-fry 1 minute or until the shrimp have turned almost totally orange. Swirl the ketchup mixture into the wok and stir-fry 1 minute or until the shrimp are just cooked through and the sauce coats the shrimp. Stir in the cilantro.",
      "Image": "//20fix.com/xfood/img/chinese-trinidadian-stir-fried-shrimp-with-rum-388610.jpg"
    },
    {
      "id": "8583",
      "Title": "Chinese Egg Noodles with Smoked Duck and Snow Peas",
      "Ingredients": {
        "1": "2 tablespoons soy sauce",
        "2": "2 tablespoons olive oil",
        "3": "1 tablespoon hoisin sauce*",
        "4": "1 tablespoon unseasoned rice vinegar",
        "5": "3 1/2 ounces snow peas or sugar snap peas, thinly sliced lengthwise (about 1 1/2 cups)",
        "6": "1 red bell pepper, cut into matchstick-size strips",
        "7": "1 17-ounce (425-gram) package thin fresh Chinese egg noodles**",
        "8": "1 pound smoked duck, turkey, or chicken, cut into 3x1/4-inch strips",
        "9": "1/2 cup fresh cilantro leaves",
        "10": "2 tablespoons thinly sliced green onion",
        "11": "1 tablespoon thinly sliced jalapeño chile with seeds (preferably red)"
      },
      "Instructions": "Whisk soy sauce, olive oil, hoisin sauce, and rice vinegar in large bowl to blend. Let dressing stand at room temperature while preparing noodles.\nPlace sliced snow peas and bell pepper strips in medium bowl. Bring kettle or large saucepan of water to boil. Pour boiling water over snow pea mixture and let soak 10 seconds. Drain well. Rinse mixture with cold water and drain again. Place egg noodles in large bowl. Bring kettle or large saucepan of water to boil, then pour boiling water over noodles; stir noodles to separate. Let noodles soak 10 seconds. Drain well. Rinse noodles with cold water; drain again.\nAdd snow pea mixture, egg noodles, smoked duck, cilantro leaves, green onion, and jalapeño to bowl with dressing. Toss well to coat. Divide noodle mixture among plates and serve.\n* Hoisin sauce is available in the Asian foods section of many supermarkets and at Asian markets.\n** Fresh Chinese egg noodles are available in the refrigerated section of Asian markets.",
      "Image": "//20fix.com/xfood/img/chinese-egg-noodles-with-smoked-duck-and-snow-peas-354302.jpg"
    },
    {
      "id": "9551",
      "Title": "Chinese Black Rice",
      "Ingredients": {
        "1": "2 cups Chinese black rice",
        "2": "3 1/2 cups water"
      },
      "Instructions": "Rinse rice in a sieve under cold running water until water runs clear.\nBring rice, water (3 1/2 cups), 1/2 teaspoon salt, and 1/4 teaspoon pepper to a boil in a 2 2 1/2- to 3-quarts heavy saucepan, uncovered, over medium-high heat. Cover and reduce heat to low, then cook until rice is tender and most of water has been absorbed, about 35 minutes.\nRemove from heat and let stand, covered, 10 minutes. Fluff with a fork.",
      "Image": "//20fix.com/xfood/img/chinese-black-rice-243608.jpg"
    },
    {
      "id": "9975",
      "Title": "Chinese Broccoli",
      "Ingredients": {
        "1": "1 pound Chinese broccoli, trimmed (or 2 bunches Broccolini)",
        "2": "2 tablespoons unsalted butter",
        "3": "2 teaspoons soy sauce",
        "4": "1/4 teaspoon Chinese five-spice powder",
        "5": "1/3 cup roasted soy nuts or peanuts, crushed"
      },
      "Instructions": "1. In a pot filled with 2 inches of water, steam the broccoli or Broccolini until the stems are just tender, 4 to 5 minutes. Transfer to a platter.\n2. Discard the water. Add the butter, soy sauce, five-spice powder, and 2 teaspoons water and place over medium-low heat.\n3. Stir until the butter has melted.\n4. Drizzle the mixture over the vegetables, top with the nuts, and serve.",
      "Image": "//20fix.com/xfood/img/chinese-broccoli-242053.jpg"
    },
    {
      "id": "10411",
      "Title": "Chinese Barbecued Baby Back Ribs",
      "Ingredients": {
        "1": "3 tablespoons chopped peeled ginger",
        "2": "2 tablespoons chopped garlic",
        "3": "1/3 cup soy sauce",
        "4": "2 tablespoons vegetable oil",
        "5": "1/2 cup hoisin sauce",
        "6": "2 tablespoons honey",
        "7": "4 pounds baby back ribs (2 to 4 racks)"
      },
      "Instructions": "Preheat oven to 400°F with rack in middle. Line a 17- by 12- by 1-inch baking pan with foil.\nPurée ginger, garlic, soy sauce, and oil in a blender, then transfer to a bowl and whisk in hoisin sauce and honey. Reserve 1/2 cup sauce and coat ribs with remainder.\nArrange ribs, meaty sides down, in pan and bake, turning and basting once with some of reserved sauce halfway through baking, until cooked through, about 40 minutes.\nTurn on broiler. Brush ribs, meaty sides up, with remaining sauce. Broil 4 to 5 inches from heat until edges are lightly charred, 4 to 8 minutes.",
      "Image": "//20fix.com/xfood/img/chinese-barbecued-baby-back-ribs-240581.jpg"
    },
    {
      "id": "10658",
      "Title": "Arctic Char with Chinese Broccoli and Sweet Potato Purée",
      "Ingredients": {
        "1": "3 red-skinned sweet potatoes (yams; about 2 1/2 pounds)",
        "2": "1 teaspoon (or more) hot prepared Chinese mustard",
        "3": "1 cup balsamic vinegar",
        "4": "1 1/2 teaspoons soy sauce",
        "5": "1 pound Chinese broccoli or broccoli rabe (rapini),* large outer leaves removed, cut crosswise on diagonal into 1/4-inch-thick slices",
        "6": "2 slices bacon, cut into 1-inch pieces",
        "7": "2 teaspoons yellow mustard seeds",
        "8": "4 5- to 6-ounce arctic char fillets",
        "9": "2 tablespoons vegetable oil, divided"
      },
      "Instructions": "Preheat oven to 400°F. Wrap sweet potatoes individually in foil. Roast until tender, 1 to 1 1/2 hours. Cool and peel. Puree in processor until smooth. Measure 3 cups puree and transfer to microwave-safe bowl. Stir in mustard. Season with salt. DO AHEAD: Can be made 1 day ahead. Cover and chill. Boil vinegar in small saucepan until reduced to ` cup, about 8 minutes. Stir in soy sauce. Remove from heat.\nCook broccoli in pot of boiling salted water until crisp-tender, about 1 minute. Drain; set aside. Cook bacon in medium skillet over medium heat until edges are crisp. Transfer to paper towels to drain. DO AHEAD: Reduction and broccoli can be made 2 hours ahead. Let stand at room temperature.\nProcess mustard seeds in spice grinder until coarsely ground. Sprinkle fish with salt and pepper. Sprinkle ground seeds over top of fish. Heat 1 tablespoon oil in large skillet over medium-high heat. Add fish, mustard side down, and cook until brown and just opaque in center, about 3 minutes per side.\nMeanwhile, rewarm puree in microwave until heated through. Heat 1 tablespoon oil in another large skillet. Add broccoli and bacon; sauté until heated through. Season with salt and pepper.\nDivide broccoli, fish, and puree among plates. Drizzle with balsamic reduction and serve.\n*Chinese broccoli is also called gai lan or Chinese kale; it's available at Asian markets. Broccoli rabe is an Italian leafy green vegetable with scattered clusters of broccoli-like florets; you'll find it at some supermarkets and at specialty foods stores.",
      "Image": "//20fix.com/xfood/img/arctic-char-with-chinese-broccoli-and-sweet-potato-puree-239797.jpg"
    },
    {
      "id": "10932",
      "Title": "Chinese Char Siu Grilled Lamb Chops",
      "Ingredients": {
        "1": "3 tablespoons hoisin sauce*",
        "2": "3 tablespoons soy sauce",
        "3": "2 tablespoons Shaoxing wine (Chinese rice wine) or dry Sherry",
        "4": "1 tablespoon sugar",
        "5": "1 teaspoon Chinese five-spice powder**",
        "6": "1/2 teaspoon salt",
        "7": "18 rib lamb chops (about 3 pounds), well trimmed",
        "8": "2 tablespoons honey",
        "9": "1 tablespoon water",
        "10": "*Available in the Asian foods section of many supermarkets and at Asian markets.",
        "11": "**A spice blend that usually contains ground fennel seeds, Szechuan peppercorns, cinnamon, star anise, and cloves; available in the spice section of most supermarkets."
      },
      "Instructions": "Whisk first 6 ingredients in small bowl. Transfer to large resealable plastic bag. Add lamb; seal bag and turn to coat. Marinate in refrigerator at least 4 hours or overnight.\nPrepare barbecue (medium-high heat). Drain lamb, leaving some marinade clinging. Grill lamb until slightly charred and cooked to desired doneness, about 21/2 minutes per side for medium-rare. Transfer to platter.\nStir honey and 1 tablespoon water in small skillet over medium heat until warm. Brush over lamb chops.",
      "Image": "//20fix.com/xfood/img/chinese-char-siu-grilled-lamb-chops-238259.jpg"
    },
    {
      "id": "11057",
      "Title": "Marinated Tri-Tip with Chinese Mustard Sauce and Roasted Green Onions and Mushrooms",
      "Ingredients": {
        "1": "1/3 cup dry red wine",
        "2": "2 tablespoons soy sauce",
        "3": "3 garlic gloves, minced",
        "4": "1 teaspoon plus 2 tablespoons dry mustard",
        "5": "1 1 1/2-pound beef tri-tip roast",
        "6": "2 tablespoons honey",
        "7": "2 tablespoons water",
        "8": "1/4 teaspoon salt",
        "9": "3 bunches green onions, root ends trimmed, dark green tops cut off and discarded",
        "10": "1 pound or three 6-ounce packages baby portobello mushrooms",
        "11": "2 tablespoons olive oil"
      },
      "Instructions": "Whisk wine, soy sauce, garlic, and 1 teaspoon dry mustard in large glass baking dish. Add tri-tip and turn to coat with marinade. Let stand at room temperature 30 minutes, turning meat occasionally.\nMeanwhile, whisk honey, 2 tablespoons water, 1/4 teaspoon salt, and remaining 2 tablespoons dry mustard in small bowl to blend; set sauce aside.\nPreheat oven to 450°F. Remove tri-tip from marinade; pat dry with paper towels. Place tri-tip on large rimmed baking sheet; sprinkle with salt and pepper. Arrange green onions and mushrooms around meat; drizzle onions and mushrooms with olive oil. Roast 12 minutes. Turn meat, onions, and mushrooms over; roast until vegetables are tender and instant-read thermometer inserted into center of meat registers 125°F for medium-rare, about 12 minutes longer.\nPlace mushrooms and green onions on platter. Cut meat into 1/4-inch-thick slices; arrange atop green onions and mushrooms. Pour any pan juices over. Drizzle lightly with mustard sauce. Serve, passing remaining mustard sauce alongside.",
      "Image": "//20fix.com/xfood/img/marinated-tri-tip-with-chinese-mustard-sauce-and-roasted-green-onions-and-mushrooms-237321.jpg"
    },
    {
      "id": "11225",
      "Title": "Braised Oxtails with Star Anise and Chinese Greens",
      "Ingredients": {
        "1": "12 (2- to 2 1/2-inch-thick) oxtail pieces (about 4 1/2 pounds), fat trimmed",
        "2": "2 cups low-salt chicken broth",
        "3": "1 large onion, halved, thinly sliced",
        "4": "1/2 cup soy sauce",
        "5": "8 large garlic cloves, peeled",
        "6": "8 whole star anise*",
        "7": "6 (1/4-inch-thick) rounds fresh ginger",
        "8": "3 tablespoons dark brown sugar",
        "9": "1 tablespoon Chinese brown bean sauce (not ground)**",
        "10": "12 to 18 yu choy, baby choy sum, or baby bok choy",
        "11": "Chopped green onions",
        "12": "*Brown star-shaped seedpods; available in the spice section of some supermarkets and at specialty foods stores and Asian markets.",
        "13": "**Available at Asian markets."
      },
      "Instructions": "Arrange oxtails in single layer in heavy large pot. Add next 8 ingredients, then enough water to cover oxtails by 1/2 inch; bring to boil. Reduce heat to low, partially cover, and simmer until very tender, adding more water by 1/2 cupfuls as needed to keep oxtails covered, about 3 hours. Cool slightly. Chill uncovered until cold, then cover and keep chilled at least 1 day and up to 3 days.\nSpoon off and discard fat from sauce. Rewarm oxtails over low heat. Transfer oxtails to large plate. Boil sauce just until reduced enough to coat spoon thinly (do not reduce too much or sauce may become salty). Discard ginger slices and star anise.\nMeanwhile, cook yu choy in large pot of boiling salted water until just tender, about 4 minutes. Drain well.\nDivide yu choy among shallow bowls. Top with oxtails and sauce and sprinkle with green onions.",
      "Image": "//20fix.com/xfood/img/braised-oxtails-with-star-anise-and-chinese-greens-236874.jpg"
    },
    {
      "id": "11780",
      "Title": "Chinese Chicken Salad",
      "Ingredients": {
        "1": "20 square wonton wrappers, thawed if frozen",
        "2": "About 2 1/2 cups vegetable oil",
        "3": "1/2 pound snow peas, trimmed 1 lb Napa cabbage, cored, then cut crosswise into 1/3-inch-wide strips (about 6 cups)",
        "4": "1 pound Napa cabbage",
        "5": "1 (1-lb) head of romaine, torn into bite-size pieces (about 8 cups)",
        "6": "1/4 cup soy sauce",
        "7": "1/4 cup fresh lemon juice",
        "8": "2 tablespoons sugar",
        "9": "1 tablespoon distilled white vinegar",
        "10": "1 teaspoon salt",
        "11": "1/2 teaspoon black pepper",
        "12": "1 tablespoon Asian sesame oil",
        "13": "1/4 cup vegetable oil",
        "14": "6 cups coarsely shredded cooked chicken (from a 2 1/2-lb rotisserie chicken)",
        "15": "1/2 cup chopped scallions",
        "16": "1/2 cup chopped fresh cilantro",
        "17": "1/2 cup sliced almonds, toasted",
        "18": "2 tablespoons sesame seeds, toasted",
        "19": "a deep-fat thermometer (if making wontons)"
      },
      "Instructions": "Cut wonton wrappers into 1/2-inch-wide strips and separate on paper towels.\nHeat 3/4 inch oil in a wide 3-quart heavy saucepan over moderate heat until it registers 350°F on thermometer. Fry strips, 5 or 6 at a time, gently turning over once with a slotted spoon, until just golden, 15 to 30 seconds per batch (some strips will fold and curl). Transfer to paper towels to drain, then season with salt.\nCook snow peas in a 4-quart pot of boiling salted water until crisp-tender, about 1 1/2 minutes. Transfer with a slotted spoon to a bowl of ice and cold water to stop cooking, then drain in a colander and pat dry. Cut diagonally into 1-inch-wide pieces and put in a large bowl with cabbage and romaine.\nWhisk together soy sauce, lemon juice, sugar, vinegar, salt, and pepper in a small bowl, then add sesame oil and vegetable oil in a slow stream, whisking until sugar is dissolved and dressing is combined well. Toss chicken and scallions with 1/3 cup of dressing in another large bowl. Whisk remaining dressing (it will separate), then add cabbage mixture, cilantro, almonds, and sesame seeds to chicken and toss with enough remaining dressing to coat. Sprinkle with wontons (if using).",
      "Image": "//20fix.com/xfood/img/chinese-chicken-salad-234995.jpg"
    },
    {
      "id": "11957",
      "Title": "Spicy Stir-Fried Chinese Long Beans with Peanuts",
      "Ingredients": {
        "1": "1 1/2 lb Chinese long beans*",
        "2": "1/2 cup unsalted dry-roasted peanuts (2 1/2 oz; not cocktail peanuts)",
        "3": "2 teaspoons soy sauce",
        "4": "2 to 3 small fresh Thai chiles** (to taste), finely chopped",
        "5": "1/2 teaspoon salt",
        "6": "1 1/2 tablespoons peanut oil",
        "7": "1 tablespoon chopped garlic",
        "8": "1 large shallot, halved lengthwise, then very thinly sliced crosswise (1/2 cup)",
        "9": "2 tablespoons fresh lime juice",
        "10": "Garnish: lime wedges",
        "11": "a well-seasoned 14-inch flat-bottomed wok"
      },
      "Instructions": "Cook untrimmed beans in a 6- to 8-quart pot of boiling salted water, uncovered, stirring occasionally, until just tender, 3 to 5 minutes. Transfer with tongs to a large bowl of ice and cold water to stop cooking, then drain in a colander and pat dry with paper towels. Trim beans and cut crosswise into 3/4-inch pieces.\nMeanwhile, pulse peanuts in a food processor until about half of peanuts are finely ground and remainder are in very large pieces (do not grind to a paste).\nStir together soy sauce, chiles, and salt in a small bowl.\nHeat wok over high heat until a bead of water dropped onto cooking surface evaporates immediately. Add oil, swirling to coat wok, then add garlic and stir-fry until garlic begins to turn pale golden, about 5 seconds. Add peanuts, and stir-fry until all of mixture is golden, about 30 seconds. Add beans, and stir-fry until hot and well coated, about 2 minutes. Remove wok from heat, then stir in soy sauce mixture and shallot, stirring until shallot has wilted. Drizzle in lime juice and season with salt, then transfer to a bowl. Serve warm or at room temperature.\n*Available at Asian markets.\n**Available at kalustyans.com.",
      "Image": "//20fix.com/xfood/img/spicy-stir-fried-chinese-long-beans-with-peanuts-234667.jpg"
    },
    {
      "id": "12101",
      "Title": "Black-Bean Shrimp with Chinese Broccoli",
      "Ingredients": {
        "1": "3/4 cup homemade chicken broth (reserved from winter melon soup ) or store-bought chicken broth (reduced-sodium if canned)",
        "2": "3 tablespoons Chinese rice wine (preferably Shaoxing) or medium-dry Sherry",
        "3": "3 teaspoons light soy sauce (preferably Pearl River Bridge brand)",
        "4": "2 teaspoons cornstarch",
        "5": "1 teaspoon sugar",
        "6": "1/4 teaspoon salt",
        "7": "1 1/2 lb gai lan (Chinese broccoli)",
        "8": "1 1/2 lb large shrimp in shell (21 to 25 per lb), peeled and deveined",
        "9": "1 tablespoon peanut or vegetable oil",
        "10": "1 (1-inch) piece fresh ginger, peeled and cut into very thin matchsticks",
        "11": "2 tablespoons fermented black beans, rinsed and chopped",
        "12": "2 garlic cloves, minced",
        "13": "1/2 fresh jalapeño chile (including seeds), or to taste, cut crosswise into 1/8-inch-thick slices",
        "14": "1 teaspoon Asian sesame oil",
        "15": "a well-seasoned 14-inch flat-bottomed wok"
      },
      "Instructions": "Stir together broth, rice wine, soy sauce, cornstarch, sugar, and salt in a small bowl until cornstarch is dissolved.\nRemove any bruised or withered outer leaves from gai lan, then trim and peel stalks, halving thick ones lengthwise. Cut crosswise into 2 1/2-inch pieces, separating leafy parts from thick stems.\nCook stems in a 6- to 8-quart pot of boiling salted water, uncovered, until crisp-tender, about 3 minutes. Add leafy parts and cook until all of gai lan is just tender, 3 to 5 minutes. Drain well, then transfer to a clean kitchen towel and pat dry. Transfer to a large dish and keep warm, loosely covered with foil.\nPat shrimp dry. Heat wok over high heat until a drop of water vaporizes instantly. Pour peanut oil around side of wok, then tilt wok to swirl oil, coating side. When oil just begins to smoke, add ginger and stir-fry 5 seconds. Add black beans, garlic, and jalapeño and stir-fry 1 minute. Working quickly, add shrimp, spreading in 1 layer on bottom and side of wok. Cook, undisturbed, 3 minutes, then stir-fry until shrimp are just pink on both sides, about 1 minute more. Stir broth mixture, then add to shrimp and bring to a boil. Boil, stirring, 2 minutes. Remove from heat and drizzle with sesame oil, then stir to combine.\nPour shrimp and sauce over gai lan.",
      "Image": "//20fix.com/xfood/img/black-bean-shrimp-with-chinese-broccoli-233803.jpg"
    },
    {
      "id": "12144",
      "Title": "Chinese Egg Rolls",
      "Ingredients": {
        "1": "2 tablespoons oyster sauce",
        "2": "1 tablespoon soy sauce",
        "3": "2 teaspoons Asian sesame oil",
        "4": "2 teaspoons sugar",
        "5": "1/2 teaspoon salt",
        "6": "About 4 cups peanut or vegetable oil",
        "7": "2 teaspoons finely chopped peeled fresh ginger",
        "8": "2 teaspoons finely chopped garlic",
        "9": "1 1/2 bunches scallions (about 10), white and pale green parts cut into 2-inch lengths, then cut lengthwise into very thin matchsticks (2 1/2 cups)",
        "10": "2 celery ribs, cut into very thin matchsticks (2 cups)",
        "11": "2 medium carrots, cut into very thin matchsticks (1 cup)",
        "12": "8 large fresh shiitake mushrooms, stems discarded and caps sliced 1/4 inch thick (3 cups)",
        "13": "1 lb medium shrimp in shell (31 to 35 per lb), peeled, deveined, and coarsely chopped",
        "14": "1/4 lb Chinese roast pork (char siu) or leftover roast pork, cut into 2-inch lengths, then cut lengthwise into very thin matchsticks",
        "15": "1 (1-lb) package Asian egg roll or spring roll wrappers",
        "16": "1 large egg, lightly beaten",
        "17": "Accompaniments: Asian sweet chile sauce; Chinese mustard",
        "18": "a deep-fat thermometer"
      },
      "Instructions": "Stir together oyster sauce, soy sauce, sesame oil, sugar, and salt in a small bowl until sugar and salt are dissolved.\nHeat a dry 12-inch heavy skillet (not nonstick) over moderately high heat until hot but not smoking, then add 2 tablespoons peanut oil, swirling skillet to coat. Stir-fry ginger, garlic, and scallions until scallions are wilted, about 1 minute. Add celery, carrots, and mushrooms and stir-fry until vegetables are softened, 4 to 6 minutes. Push vegetables toward edge of skillet, then add shrimp to center and stir-fry until shrimp are just cooked through, 3 to 5 minutes. Add pork and oyster sauce mixture and stir together all ingredients in skillet until combined. Season with salt and transfer to a large shallow bowl. Cool, stirring occasionally, about 30 minutes.\nGently peel apart wrappers to separate if necessary (wrappers may not be perfectly square).\nPut 1 wrapper on a work surface, arranging wrapper with a corner nearest you and keeping remaining wrappers covered with plastic wrap. Stir filling, then spread a scant 1/4 cup filling horizontally across center of wrapper to form a 4-inch log. Fold bottom corner over filling, then fold in side corners. Brush top corner with egg and roll up wrapper tightly to enclose filling, sealing roll closed with top corner. Transfer roll, seam side down, to a paper-towel-lined baking sheet and loosely cover with plastic wrap. Make more egg rolls in same manner, transferring to baking sheet as formed (you may have some filling left over).\nPut oven rack in middle position and preheat oven to 250°F. Line a large colander with paper towels. Heat 1 inch peanut oil in a 5- to 6-quart wide heavy pot until it registers 350°F on thermometer, then fry 4 or 5 egg rolls (don't crowd pot), turning with a slotted spoon, until golden brown, 3 to 5 minutes. Transfer with slotted spoon to colander and drain rolls upright 2 to 3 minutes, then keep warm on a rack set on a large baking sheet in oven. Fry remaining egg rolls in batches, transferring to colander and then to rack in oven.",
      "Image": "//20fix.com/xfood/img/chinese-egg-rolls-233522.jpg"
    },
    {
      "id": "12780",
      "Title": "Chinese Hot-and-Sour Soup",
      "Ingredients": {
        "1": "5 ounces boneless pork loin, cut into 1/4-inch-thick strips (2/3 cup)",
        "2": "2 teaspoons dark soy sauce*",
        "3": "4 small Chinese dried black mushrooms*",
        "4": "12 small dried tree ear mushrooms*",
        "5": "1 1/2 tablespoons cornstarch",
        "6": "12 dried lily buds* (sometimes called golden needles)",
        "7": "1/2 cup canned sliced bamboo shoots*, cut lengthwise into 1/8-inch-wide strips (from an 8-oz can)",
        "8": "2 tablespoons red-wine vinegar",
        "9": "2 tablespoons rice vinegar (not seasoned)",
        "10": "1 tablespoon light soy sauce*",
        "11": "1 1/2 teaspoons sugar",
        "12": "1 teaspoon kosher salt",
        "13": "2 tablespoons peanut oil",
        "14": "4 cups reduced-sodium chicken broth",
        "15": "3 to 4 oz firm tofu (about a quarter of a block), rinsed and drained, then cut into 1/4-inch-thick strips",
        "16": "2 large eggs",
        "17": "2 teaspoons Asian sesame oil*",
        "18": "1 1/2 teaspoons freshly ground white pepper",
        "19": "2 tablespoons thinly sliced scallion greens",
        "20": "2 tablespoons fresh whole cilantro leaves",
        "21": "*Available at Asian foods markets, Uwajimaya (800-889-1928), and Kam Man Food Products Inc. (212-571-0330)."
      },
      "Instructions": "Toss pork with dark soy sauce in a bowl until pork is well coated.\nSoak black and tree ear mushrooms in 3 cups boiling-hot water in another bowl (water should cover mushrooms), turning over black mushrooms occasionally, until softened, about 30 minutes. (Tree ears will expand significantly.) Cut out and discard stems from black mushrooms, then squeeze excess liquid from caps into bowl and thinly slice caps. Remove tree ears from bowl, reserving liquid, and trim off any hard nubs. If large, cut tree ears into bite-size pieces. Stir together 1/4 cup mushroom-soaking liquid (discard remainder) with cornstarch in a small bowl and set aside.\nMeanwhile, soak lily buds in about 1 cup warm water until softened, about 20 minutes, then drain. Trim off tough tips of lily buds. Cut lily buds in half crosswise, then tear each half lengthwise into 2 or 3 shreds.\nCover bamboo shoots with cold water by 2 inches in a small saucepan, then bring just to a boil (to remove bitterness) and drain in a sieve.\nStir together vinegars, light soy sauce, sugar, and salt in another small bowl.\nHeat a wok over high heat until a bead of water vaporizes within 1 to 2 seconds of contact. Pour peanut oil down side of wok, then swirl oil, tilting wok to coat sides. Add pork and stir-fry until meat just changes color, about 1 minute, then add black mushrooms, tree ears, lily buds, and bamboo shoots and stir-fry 1 minute.\nAdd broth and bring to a boil, then add tofu. Return to a boil and add vinegar mixture. Stir cornstarch mixture, then add to broth and return to a boil, stirring. (Liquid will thicken.) Reduce heat to moderate and simmer 1 minute.\nBeat eggs with a fork and add a few drops of sesame oil. Add eggs to soup in a thin stream, stirring slowly in one direction with a spoon. Stir in white pepper, then drizzle in remaining sesame oil and divide among 6 to 8 bowls. Sprinkle with scallions and cilantro before serving.",
      "Image": "//20fix.com/xfood/img/chinese-hot-and-sour-soup-231354.jpg"
    },
    {
      "id": "12788",
      "Title": "Sticky Rice with Chinese Sausage and Dried Scallops",
      "Ingredients": {
        "1": "2 1/2 cups Chinese or Japanese short-grain sticky (\"sweet\") rice",
        "2": "6 to 8 (1-inch-wide) large dried scallops",
        "3": "1/2 cup Chinese rice wine such as Shaoxing or medium-dry Sherry",
        "4": "12 to 15 Chinese dried black mushrooms",
        "5": "4 links Cantonese sweet sausage",
        "6": "2 bunches of scallions",
        "7": "1/4 cup oyster sauce (preferably premium)",
        "8": "2 tablespoons light soy sauce",
        "9": "1 tablespoon sugar",
        "10": "1 teaspoon kosher salt",
        "11": "1/4 cup peanut oil",
        "12": "2 tablespoons Asian sesame oil",
        "13": "2 teaspoons black pepper",
        "14": "a well-seasoned 14-inch wok, preferably flat-bottomed; a 10-inch bamboo steamer with 2 tiers; cheesecloth"
      },
      "Instructions": "Cover rice with cold water by 1 inch in a bowl and soak at least 4 and up to 12 hours.\nAfter rice has soaked at least 3 hours, fill wok with enough water for bottom rim of steamer (not rack) to rest in water, then bring to a boil.\nPut scallops and rice wine in a small heatproof bowl. Put bowl with scallops in bottom tier of steamer and steam, covered, until soft, about 2 hours. (Replenish water as necessary to keep bottom rim of steamer in water to prevent scorching.)\nWhen scallops have steamed for almost 1 hour, line bottom and side of top tier of steamer with several layers of cheesecloth, then set tier onto steamer in wok.\nDrain rice in a sieve and rinse well under cold running water, then spread rice in an even layer over cheesecloth in steamer (cheesecloth should not hang over edge of steamer) and steam, covered, sprinkling rice with a few drops of water occasionally, 1 hour. (Replenish water as necessary to keep bottom rim of steamer in water to prevent scorching.)\nMeanwhile, soak mushrooms in 2 cups boiling-hot water in a bowl (water should cover mushrooms), turning mushrooms over occasionally, until softened, about 30 minutes. Cut out and discard stems from mushrooms, then squeeze excess liquid from caps into bowl and thinly slice caps. Reserve 1/2 cup mushroom- soaking liquid and discard remainder.\nRemove top tier of steamer from wok and transfer rice from cheesecloth to a platter. Once rice has cooled, lightly wet your hands and break up large clumps.\nUsing tongs, remove bowl containing scallops from bottom tier of steamer. Reserve water in wok.\nReserve scallop-soaking liquid and shred scallops into \"threads\" with a fork or your fingers, discarding tough muscle on side (muscle will remain solid but scallop meat will shred easily).\nBring water in wok to a boil, then arrange sausages on a heatproof plate and steam in steamer, covered, 5 minutes. When cool enough to handle, halve sausages lengthwise, then cut diagonally into 1/4-inch-thick slices.\nCut scallions into 1/4-inch-thick slices, keeping pale green and white parts separate from dark green parts.\nStir together oyster sauce, soy sauce, sugar, and salt in a bowl until sugar is dissolved.\nPour off water from wok and dry. Heat wok over high heat until a bead of water vaporizes within 1 to 2 seconds of contact. Pour peanut oil down side of wok, then swirl oil, tilting wok to coat sides. Add mushrooms and pale green and white parts of scallions and stir-fry 1 minute. Add sausage and scallops and stir-fry 1 minute. Add rice and stir-fry, breaking up any clumps, 1 minute. Add scallop- and mushroom-soaking liquids along with oyster sauce mixture and stir-fry until rice is well coated and hot, about 2 minutes. Add sesame oil, then add pepper and remaining scallion greens and stir-fry until combined well.",
      "Image": "//20fix.com/xfood/img/sticky-rice-with-chinese-sausage-and-dried-scallops-231372.jpg"
    },
    {
      "id": "12956",
      "Title": "Sticky Rice with Chinese Sausage",
      "Ingredients": {
        "1": "3 cups Chinese or Japanese short-grain sticky (\"sweet\") rice*",
        "2": "1 cup Chinese dried black mushrooms* or dried shiitake mushrooms (1 1/2 oz)",
        "3": "5 Chinese sausages* (6 to 8 oz total)",
        "4": "1 tablespoon peanut oil",
        "5": "1 tablespoon minced peeled fresh ginger",
        "6": "1/2 cup thinly sliced scallion (white and pale green parts only; from 1 bunch)",
        "7": "1 1/2 cups bottled peeled cooked whole chestnuts (from a 14- to 15-oz jar), drained and coarsely chopped",
        "8": "1/3 cup Chinese rice wine or medium-dry Sherry",
        "9": "3 tablespoons soy sauce",
        "10": "2 tablespoons oyster sauce",
        "11": "2 teaspoons Asian sesame oil",
        "12": "1 teaspoon salt",
        "13": "1/2 teaspoon white pepper",
        "14": "2 cups reduced-sodium chicken broth",
        "15": "Garnish: thinly sliced scallion greens",
        "16": "a wok"
      },
      "Instructions": "Cover rice with cold water by 1 inch in a large bowl and soak at least 2 hours. Drain in a sieve and rinse well under cold running water.\nSoak mushrooms in warm water 30 minutes, then drain, squeezing excess liquid back into bowl, and discard liquid. Rinse mushrooms to remove any grit, then discard stems and coarsely chop caps. 3Quarter sausages lengthwise and cut into 1/2-inch pieces.\nHeat a wok over high heat until just smoking. Add peanut oil and heat, swirling in wok, until just smoking. Add ginger and scallion and stir-fry 30 seconds. Add sausage and stir-fry 1 minute, then add mushrooms and stir-fry 1 minute. Add chestnuts and stir-fry 1 minute. Stir in rice wine, soy sauce, oyster sauce, sesame oil, salt, and white pepper and remove from heat. Add drained rice and stir to coat.\nTransfer mixture to a 4- to 6-quart heavy pot and add broth (broth will not completely cover rice). Bring to a simmer, stir once, then reduce heat to low. Cover and cook 25 minutes more, then remove from heat. Stir from bottom to distribute ingredients and let stand, covered, 10 minutes before serving.\n*Available at Asian markets and Kam Man Food Products (212-571-0330).",
      "Image": "//20fix.com/xfood/img/sticky-rice-with-chinese-sausage-230998.jpg"
    }
  ],
  "t": 21,
  "p": {
    "limitstart": 0,
    "limit": 25,
    "total": 21,
    "pagesStart": 1,
    "pagesStop": 1,
    "pagesCurrent": 1,
    "pagesTotal": 1
  }
}