{
  "s": 1,
  "d": [
    {
      "id": "572",
      "Title": "Bagels with Japanese-ish Fixings",
      "Ingredients": {
        "1": "1 or 2 bagels per person, split",
        "2": "1 1/2 cups Aonori Cream Cheese (recipe below)",
        "3": "1 pound Shiso Gravlax (recipe below), sliced thin",
        "4": "1/2 red onion, sliced thin",
        "5": "6 to   8 shiso leaves, cut into ribbons",
        "6": "Furikake, store-bought or your choice of homemade (see below)",
        "7": "12 ounces cream cheese, softened",
        "8": "3 tablespoons aonori (powdered dried green seaweed)",
        "9": "1 pound skin-on salmon fillet, as fresh and beautiful as possible",
        "10": "2/3 cup packed brown sugar",
        "11": "1/3 cup kosher salt",
        "12": "1 cup loosely packed sliced shiso leaves",
        "13": "1/2 cup dried onion flakes",
        "14": "1/2 cup aonori (powdered dried green seaweed)",
        "15": "2 tablespoons plus 1 teaspoon white sesame seeds",
        "16": "2 tablespoons plus 1 teaspoon black sesame seeds",
        "17": "1 tablespoon sugar",
        "18": "1 teaspoon kosher salt",
        "19": "2 cups tightly packed katsuobushi (bonito flakes)",
        "20": "1/3 cup white sesame seeds",
        "21": "1/3 cup black sesame seeds",
        "22": "1 tablespoon plus 1 teaspoon togarashi shichimi",
        "23": "1 tablespoon kosher salt"
      },
      "Instructions": "Use a spoon or spatula to mix the cream cheese and aonori together in a bowl. This will keep, covered, in the fridge for a few days.\nUsing tweezers, carefully remove any pin bones from the salmon fillet. Find a deep baking dish or plastic container that holds the fish snugly.\nCombine the sugar, salt, and shiso in a bowl. Sprinkle a 1/2-inch layer of the mixture in the baking dish and lay the salmon on top, skin side down. Pack the fish in the rest of the salt-sugar-shiso mixture and cover loosely with a large piece of plastic wrap. You need to weight down the salmon, which you can go about in a couple different ways: A) If you have a dish or container that is slightly smaller than the one the salmon is sitting in, set the smaller container on top of the fish and weight it down with a few cans or a brick; B) Alternatively, fill a large zip-top bag three-quarters full with cold water and seal. Nestle the bag over the piece of fish. If the bag hangs over the sides of the baking dish, pour out some of the water and reseal. In either case, wrap the whole apparatus tightly in plastic wrap and allow the fish to cure in the refrigerator for 1 day.\nAfter a day, unwrap the fish and flip it over, being sure all the flesh comes into contact with the curing mix (which should be mostly liquid at this point). Weight the fish down again and wrap it again in fresh plastic. Cure in the fridge for 3 or 4 more days, depending on the thickness of your fillet. The gravlax is ready when the fish is firm to the touch.\nWipe the cure off the salmon and wrap it in clean plastic wrap. Refrigerate until ready to serve. It will keep for up to a week.\nPulse the dried onion in a food processor or spice grinder five times, or until powdery. Transfer to a bowl, add the remaining ingredients, and stir well. Store in an airtight container for up to a couple weeks. Give it a good shake before serving.\nWorking in batches, use a mortar and pestle, food processor, or spice grinder to pulverize the katsuobushi flakes into a fine powder. Transfer to a bowl, add the remaining ingredients, and stir well. Store in an air-tight container for up to a week.\nSet out a spread of the sliced bagels and toppings and let people do as they please.",
      "Image": "//20fix.com/xfood/img/bagels-with-japanese-ish-fixings.jpg"
    },
    {
      "id": "2272",
      "Title": "Japanese-Style Curry (Karei Raisu)",
      "Ingredients": {
        "1": "4 tablespoons unsalted butter",
        "2": "2 tablespoons vegetable oil",
        "3": "1 large yellow onion, thinly sliced into half moons",
        "4": "1 pound boneless fatty beef (such as chuck, short rib, or belly), cut into 3/4-inch pieces",
        "5": "1/2 pound carrots (about 2 medium), peeled and roughly chopped into irregular 3/4-inch pieces",
        "6": "1/2 pound russet potato (about 1 small), peeled and roughly chopped into irregular 3/4-inch pieces",
        "7": "5 ounces medium-hot Vermont Curry (7 pieces; see Note)",
        "8": "1 teaspoon kosher salt",
        "9": "6 cups cooked short- grain white rice, hot"
      },
      "Instructions": "Heat the butter and oil in a medium pot over medium-high heat until the butter melts and bubbles. Add the onion and cook, stirring occasionally, until it’s translucent and slightly wilted, about 5 minutes. Add the beef and cook, stirring occasionally, just until the pieces are no longer pink on the outside, about 5 minutes.\nAdd potatoes and carrots, stir well, and add 7 cups of water. Bring the water to a boil over high heat, skim off any froth that appears on the surface, then reduce the heat to maintain a strong simmer. Cook, stirring occasionally, until the beef is very tender, about 1 hour. Add the curry paste and salt and continue cooking, stirring and scraping the bottom frequently, for 15 minutes more. To store, cool to room temperature and keep in an airtight container in the fridge for up to 3 days.\nDivide the rice among shallow bowls, spoon on the curry, and serve immediately.",
      "Image": "//20fix.com/xfood/img/japanese-style-curry-karei-raisu.jpg"
    },
    {
      "id": "2375",
      "Title": "Japanese-Style Fried Rice (Chahan)",
      "Ingredients": {
        "1": "1/4 cup diced (1/4-inch cubes) carrot",
        "2": "12 medium shrimp (about 6 ounces), peeled and deveined, cut crosswise into thirds",
        "3": "1/4 cup fresh or frozen corn kernels",
        "4": "1/4 cup fresh or frozen shelled edamame",
        "5": "1/4 cup diced (1/4-inch pieces) fresh shiitake mushrooms or rehydrated dried shiitakes",
        "6": "2 1/4 cups low-sodium chicken stock",
        "7": "3 tablespoons Japanese soy sauce",
        "8": "3 tablespoons sake (Japanese rice wine)",
        "9": "2 teaspoons granulated sugar",
        "10": "1 1/2 teaspoons kosher salt",
        "11": "3 tablespoons cornstarch",
        "12": "2 teaspoons toasted sesame oil",
        "13": "White or black pepper to taste",
        "14": "1/4 cup vegetable oil",
        "15": "4 large eggs, lightly beaten",
        "16": "6 packed cups cooked short-grain white rice, preferably 1 or 2 days old",
        "17": "1 generous tablespoon thinly sliced scallion greens"
      },
      "Instructions": "Bring a small pot of water to a boil. Add the carrot and cook 2 minutes. Add the shrimp and cook until they’re just cooked through, 1 to 2 minutes more. Drain and then return them to the pot. Add the corn, edamame, shiitakes, chicken stock, soy sauce, sake, sugar, and 1/2 teaspoon of salt. Set the pot over medium-high heat and bring to a boil. In a small container, stir together the cornstarch and 3 tablespoons of water until smooth. Gradually add the cornstarch mixture to the pot, stirring constantly. Let the stock mixture come to a boil again and cook just until slightly thickened, about 3 minutes. Take the pot off the heat and stir in the sesame oil and pepper to taste; keep warm, covered.\nHeat the vegetable oil in a large skillet over medium-high heat until it shimmers. Add the eggs and cook, stirring constantly, until they’re barely cooked, about 30 seconds. Add the rice and cook, stirring often and breaking up the clumps but making sure not to smash the grains, until the rice is heated through and the egg has browned slightly, about 4 minutes. Season with about 1 teaspoon of the salt and pepper to taste.\nDivide the fried rice among 4 small bowls and firmly press down on the rice to pack it into the bowls. Overturn the bowls onto 4 large shallow bowls. Remove the bowls to reveal the mounds of rice and pour the sauce over each one. Top with the scallions and serve.",
      "Image": "//20fix.com/xfood/img/japanese-style-fried-rice-chahan.jpg"
    },
    {
      "id": "2741",
      "Title": "Red Curry–Marinated Japanese Eggplant",
      "Ingredients": {
        "1": "6 Fresno chiles, seeds removed from 3, chopped",
        "2": "4 garlic cloves",
        "3": "2 lemongrass stalks, bottom third only, tough outer layers removed, finely grated",
        "4": "1/3 cup vegetable oil",
        "5": "1 tablespoon finely grated peeled ginger",
        "6": "1 teaspoon ground cumin",
        "7": "1/2 teaspoon sugar",
        "8": "1 teaspoon kosher salt, plus more",
        "9": "4 Japanese eggplants, halved lengthwise"
      },
      "Instructions": "Purée chiles, garlic, lemongrass, oil, ginger, cumin, sugar, and 1 tsp. salt in a blender or food processor until smooth. Score cut sides of eggplant in a cross-hatch pattern with the tip of a sharp knife. Coat each eggplant liberally with curry paste; set aside any remaining paste. Let eggplants sit at least 10 minutes and up to 1 hour.\nPrepare a grill for medium-high heat. Lightly season eggplants with salt and grill, turning occasionally, until browned and tender, about 5 minutes per side. Serve with reserved curry paste.\nMarinade can be made 3 days ahead. Cover and chill.",
      "Image": "//20fix.com/xfood/img/red-curry-marinated-japanese-eggplant.jpg"
    },
    {
      "id": "3219",
      "Title": "Steamed Japanese Rice",
      "Ingredients": {
        "1": "2 cups Japanese short-grain white or haiga rice"
      },
      "Instructions": "Place rice in a large saucepan, add water to cover, and swirl rice with your hand (water will become cloudy). Drain through a fine-mesh sieve and return rice to saucepan. Repeat process until water is clear when mixed with rice (3 or 4 times). Drain rice a final time and cover sieve with a kitchen towel; let rest 15 minutes (this will help the grains hydrate evenly).\nReturn rice to same saucepan and add 2 cups water. Partially cover pot and bring to a boil. Stir once, cover, and reduce heat. Simmer until water is mostly absorbed and rice is very fragrant and tender, 10–12 minutes. Remove from heat and let rest, covered, 10 minutes. Fluff rice with a large spoon, re-cover pot, and let sit 5 minutes before serving.",
      "Image": "//20fix.com/xfood/img/steamed-japanese-rice.jpg"
    },
    {
      "id": "3480",
      "Title": "Gyoza (Japanese Dumplings)",
      "Ingredients": {
        "1": "1 packet 50 gyoza wrappers",
        "2": "1/8 cabbage",
        "3": "1 teaspoon salt",
        "4": "400 g lean pork or chicken",
        "5": "1/2 bunch garlic chives, finely chopped",
        "6": "4 dried shiitake mushrooms, soaked in hot water and finely chopped",
        "7": "1 tablespoon grated ginger",
        "8": "2 teaspoons soy sauce",
        "9": "2 teaspoons sesame oil, plus 2 teaspoons extra, for cooking",
        "10": "Pinch of salt",
        "11": "2 tablespoons soy sauce",
        "12": "2 tablespoons rice vinegar",
        "13": "La-yu (Japanese chilli oil), optional"
      },
      "Instructions": "Dice cabbage finely and sprinkle with 1 teaspoon salt. Give it a bit of a massage. Leave for 10–15 minutes and then squeeze with your hands to remove any moisture.\nWith your hands thoroughly mix together cabbage, ground meat, chives, mushrooms, ginger, soy sauce, sesame oil and pinch of salt.\nDry your hands completely (or wrappers will stick). Place a gyoza wrapper on one hand and put 1 teaspoon filling in centre of wrapper.\nBrush edge of half the wrapper with cold water. Make a semi-circle by folding the wrapper in half. Pinch open sides of wrapper together with your fingers and seal the top.\nPlace a large frying pan over medium-high heat, add 2 teaspoons sesame oil and arrange 20–25 gyoza in pan. Add 200ml water to cover bottom of pan, cover with lid and cook on medium-high heat for 6–7 minutes or until translucent, cooked and no liquid is left in pan. Take off lid and cook for another 30–60 seconds for the bottoms to go crunchy. Cook remaining gyoza or freeze them.\nMix together soy sauce, vinegar and chilli oil, if using. Serve gyoza hot with dipping sauce.",
      "Image": "//20fix.com/xfood/img/gyoza-japanese-dumplings-56390033.jpg"
    },
    {
      "id": "3561",
      "Title": "3-Ingredient Japanese Cheesecake",
      "Ingredients": {
        "1": "9 ounces white chocolate (about 1 1/2 cups chips or chopped chocolate)",
        "2": "8 ounces cream cheese, room temperature",
        "3": "6 large eggs, separated, room temperature",
        "4": "A 8\" round cake pan"
      },
      "Instructions": "Preheat oven to 350°F. Line bottom of 8\" cake pan with parchment paper. Cut a 21x5\" strip of parchment, butter or oil parchment, and line sides of pan. Center the pan on a large piece of foil and fold foil up over the sides to prevent water from entering pan.\nPlace white chocolate in a medium heatproof bowl and heat in microwave in 20-second intervals (or set bowl over a saucepan of barely simmering water), stirring occasionally, until melted. Transfer to a large bowl and stir in cream cheese. Let cool slightly, then add yolks and stir to combine.\nUsing an electric mixer on high speed, whip egg whites in another large bowl until stiff peaks form. Add a small portion of egg whites to chocolate mixture and stir just until lightened. Gently fold in remaining egg whites in 2 additions until just combined.\nPour batter into prepared pan. Place pan in a baking dish or roasting pan and add warm water to reach halfway up sides of cake pan. Bake cheesecake until set, 40–45 minutes. Turn oven off and leave pan in oven 15 minutes, then transfer to a wire rack and let cool completely. Remove cheesecake from pan, transfer to a platter, and chill until cold, at least 4 hours or up to overnight.",
      "Image": "//20fix.com/xfood/img/three-ingredient-japanese-cheesecake-56389916.jpg"
    },
    {
      "id": "4621",
      "Title": "Glazed Japanese Chicken Meatballs on Skewers",
      "Ingredients": {
        "1": "1/4 cup low-sodium soy sauce",
        "2": "1/4 cup dry sake",
        "3": "1/4 cup sugar",
        "4": "2 tablespoons sherry vinegar, plus more, for seasoning",
        "5": "1 1/2 pounds ground chicken or turkey, preferably dark meat",
        "6": "1 tablespoon minced shallot",
        "7": "1 tablespoon minced fresh ginger",
        "8": "1 teaspoon minced garlic (1 small clove)",
        "9": "1 teaspoon kosher salt",
        "10": "1 teaspoon toasted sesame oil",
        "11": "Sesame seeds",
        "12": "Thinly sliced scallion greens",
        "13": "Steamed rice (optional)"
      },
      "Instructions": "In a small saucepan, combine the soy sauce, sake, sugar and vinegar and bring to a boil. Boil over high heat until thickened to a glaze, 2 to 3 minutes. Taste and season with a fresh splash of vinegar, if you like.\nPreheat the grill for at least 10 minutes, preparing to grill over moderately high heat, and soak 8 double-pronged bamboo skewers or 16 single skewers in water.\nIn a bowl, use your hands to mix together all of the ingredients except for the sesame seeds and scallion greens.\nForm the meat mixture into 16 meatballs. Thread the meatballs onto the skewers, leaving just a little space in between and flatten slightly.\nOil the grates well and grill the meatball skewers until light grill marks form, 3 to 4 minutes. Flip and grill for 2 minutes longer, until the outside of the meatballs looks cooked.\nBrush the sauce over the meatballs, flip and brush the other side. Flip them and brush them with the sauce constantly for about 1 minute, until glazed and cooked through. If the sauce darkens too quickly, reduce the heat or move the skewers to a cooler part of the grill.\nTransfer the skewers to a platter and sprinkle with sesame seeds and sliced scallions. Serve over rice, if desired.",
      "Image": "//20fix.com/xfood/img/glazed-japanese-chicken-meatballs-on-skewers-51237210.jpg"
    },
    {
      "id": "5267",
      "Title": "Strip Steak with Japanese Dipping Sauce",
      "Ingredients": {
        "1": "2 sprigs rosemary plus leaves for serving",
        "2": "2 sprigs thyme plus leaves for serving",
        "3": "2 strip steaks (about 1\" thick; 1 1/2 pounds total), cut in half crosswise, room temperature",
        "4": "1 tablespoon olive oil",
        "5": "Kosher salt, freshly ground pepper",
        "6": "1/2 cup ponzu",
        "7": "1/4 cup finely grated carrot",
        "8": "1/4 cup finely grated daikon (Japanese white radish)"
      },
      "Instructions": "Prepare grill for medium-high heat. Place rosemary and thyme sprigs on a plate and microwave on high until brittle, about 2 minutes.\nRub steaks with oil, season with salt and pepper, and sprinkle with herbs, crushing gently and pressing to adhere. Grill steaks to desired doneness, about 4 minutes per side for medium-rare. Let rest 5 minutes.\nMeanwhile, mix ponzu, carrot, and daikon in a small bowl. Top steaks with rosemary and thyme leaves; serve with dipping sauce.",
      "Image": "//20fix.com/xfood/img/strip-steak-with-japanese-dipping-sauce-51187080.jpg"
    },
    {
      "id": "6144",
      "Title": "Japanese-Style Seasoning Salt",
      "Ingredients": {
        "1": "1 1/2 toasted, crumbled nori sheets",
        "2": "1/4 cup toasted sesame seeds",
        "3": "finely grated zest of 2 tangerines or lemons",
        "4": "1 tablespoon kosher salt",
        "5": "1 tablespoon toasted Sichuan peppercorns",
        "6": "2 teaspoons ground ginger",
        "7": "2 teaspoons paprika",
        "8": "2 teaspoons toasted white or black poppy seeds",
        "9": "large pinch of cayenne pepper"
      },
      "Instructions": "Grind toasted, crumbled nori sheets in a spice mill to a fine powder. Add toasted sesame seeds, finely grated zest of tangerines or lemons, kosher salt, toasted Sichuan peppercorns, ground ginger, paprika, toasted white or black poppy seeds, and cayenne pepper; pulse to a uniform spice blend but not to a powder. DO AHEAD: Can be made 3 days ahead. Store airtight at room temperature.",
      "Image": "//20fix.com/xfood/img/japanese-style-seasoning-salt-51104340.jpg"
    },
    {
      "id": "6592",
      "Title": "Traditional Japanese Breakfast",
      "Ingredients": {
        "1": "3 1/2 oz short-grain rice",
        "2": "2 tbsp mixed Japanese pickles, such as cucumber, daikon, cabbage",
        "3": "1 tbsp instant dashi (Japanese stock) or vegetable",
        "4": "Stock powder",
        "5": "2 1/4 cups boiling water",
        "6": "2 medium-sized potatoes, peeled and chopped into small cubes",
        "7": "1 tbsp white miso paste",
        "8": "1 spring onion, very finely chopped",
        "9": "1-inch piece of fresh ginger, finely chopped",
        "10": "1 spring onion, finely chopped",
        "11": "2 tbsp soy sauce",
        "12": "2 5-oz fillets of salmon",
        "13": "3 medium free-range eggs",
        "14": "1 tsp sugar",
        "15": "2 tsp soy sauce",
        "16": "1 tsp bonito flakes or instant dashi powder (optional)",
        "17": "vegetable oil for cooking"
      },
      "Instructions": "Cook the rice according to the instructions.\nPut the instant dashi stock in a pan with the boiling water. Add the potato and simmer over medium heat for about six minutes, or until the potato is cooked.\nLadle some soup from the pan into a bowl and dissolve the miso in it. Gradually return the miso mixture to the soup. Stir the soup gently but don't let it come to the boil once you've added the miso. Turn off the heat and add the chopped spring onion.\nServe hot in small bowls.\nMix the ginger, spring onion and soy sauce together and pour over the salmon fillets. Leave them to stand at room temperature for 15 minutes.\nPour a little boiling water into the grill pan and place the fish on the grill rack above the water (this keeps it moist while it grills). Grill the fish under medium to high heat for about 5-6 minutes on each side, taking care not to overcook it.\nCombine the eggs, sugar, soy sauce and bonito flakes (or instant dashi), if using, and mix the ingredients thoroughly.\nHeat a little vegetable oil in a small, non-stick frying pan over medium to high heat and add the egg mixture. Agitate the eggs, using a wooden spoon, so the texture of the omelette remains fluffy.\nWhen the eggs are half-cooked, fold the omelette in half, to make a semi-circle, then fold the curving section inwards to form a rectangle, and then fold the ends inwards until you have what looks like a little square package. This creates the distinctive layered effect, called tamagoyaki, characteristic of a Japanese omelette.\nFlip the \"package\" over and cook for a further two minutes. Cut into quarters.\nJapanese etiquette decrees that you place the bowl of rice on your left and the bowl of miso soup on your right. Serve the fish on a separate plate, the pickles in a small bowl, and the omelette on another small plate. Now test your hungover skills with chopsticks.",
      "Image": "//20fix.com/xfood/img/traditional-japanese-breakfast-369329.jpg"
    },
    {
      "id": "7057",
      "Title": "Whole Grilled Japanese Eggplant with Lemon and Soy Sauce",
      "Ingredients": {
        "1": "2 tablespoons soy sauce",
        "2": "4 teaspoons lemon juice",
        "3": "2 teaspoons olive oil",
        "4": "4 Japanese eggplants (about 1 pound)",
        "5": "1/4 cup katsuobushi, dried, shaved bonito flakes (a type of tuna), optional"
      },
      "Instructions": "Whisk together the soy sauce, lemon juice, and olive oil in a bowl to make the dressing; set aside. Score the stem end of each eggplant, making a circular cut in the skin (this will make the eggplant easier to peel). Poke a few holes into the eggplants with a skewer or fork to allow steam to escape as they grill.\nPreheat a grill to medium. Grill for about 8 minutes, turning the eggplants a quarter turn every 2 minutes. Try to grill the eggplant all around. Test the eggplants for doneness by pressing against their sides with a pair of tongs. If the eggplants give easily, they're ready. Transfer the eggplants to a plate.\nAs soon as the eggplants are cool enough to handle, carefully peel off the skin (the skin comes off more easily if the eggplant is warm; don't let it cool completely). Once you've removed the skin, remove the stems, and slice each eggplant into 4 pieces, cutting on an angle. Transfer the eggplant slices to a platter. Drizzle with dressing, sprinkle with the bonito, and serve.",
      "Image": "//20fix.com/xfood/img/whole-grilled-japanese-eggplant-with-lemon-and-soy-sauce-365629.jpg"
    },
    {
      "id": "7672",
      "Title": "Japanese-Style Grilled Fish",
      "Ingredients": {
        "1": "1/4 cup soy sauce",
        "2": "1/4 cup sake or dry white wine",
        "3": "1/4 cup mirin or sweet sherry",
        "4": "2 tablespoons sugar",
        "5": "2 tablespoons grated fresh ginger",
        "6": "4 fish fillets (bluefish, mackerel, or other oily fish), about 6 ounces each",
        "7": "Olive oil",
        "8": "Kosher or sea salt and freshly ground black pepper to taste",
        "9": "Lemon slices for serving"
      },
      "Instructions": "1. To make the marinade, combine all the ingredients in a small saucepan. Bring to a boil over medium-high heat, and then immediately remove from the heat. Cover and let cool to room temperature.\n2. Arrange the fish fillets in a deep baking dish and pour the marinade over. Cover and refrigerate for 4 hours or overnight, turning the fish occasionally.\n3. Prepare a hot fire in a grill. Oil the grill grate or a perforated grill rack.\n4. Remove the fish from the marinade and pat dry. Brush or spray the fillets on both sides with olive oil. Place the fish, flesh side down, on the grill rack and grill for 10 minutes per inch of thickness, turning once halfway through. A fish fillet is done when it begins to flake when tested with a fork in the thickest part. Remove from the grill, season with salt and pepper, and serve hot, garnished with fresh lemon slices.",
      "Image": "//20fix.com/xfood/img/japanese-style-grilled-fish-359629.jpg"
    },
    {
      "id": "8449",
      "Title": "Japanese Turnips with Miso",
      "Ingredients": {
        "1": "3 tablespoons white miso",
        "2": "3 tablespoons unsalted butter, softened, divided",
        "3": "3 pounds small (1 1/2-to 2-inch) Japanese turnips with greens",
        "4": "1 1/3 cups water",
        "5": "2 tablespoons mirin (Japanese sweet rice wine)"
      },
      "Instructions": "Stir together miso and 2 tablespoon butter.\nDiscard turnip stems and coarsely chop leaves. Halve turnips (leave whole if tiny) and put in a 12-inch heavy skillet along with water, mirin, remaining tablespoon butter, and 1/8 teaspoon salt. Bring to a boil over medium-high heat, then boil, covered, 10 minutes.\nAdd greens by handfuls, turning and stirring with tongs and adding more as volume in skillet reduces. Cover and cook 1 minute. Uncover and continue boiling, stirring occasionally, until turnips are tender and liquid is reduced to a glaze, about 5 minutes. Stir in miso butter and cook 1 minute.",
      "Image": "//20fix.com/xfood/img/japanese-turnips-with-miso-354957.jpg"
    },
    {
      "id": "10429",
      "Title": "Roasted Japanese Sweet Potatoes with Scallion Butter",
      "Ingredients": {
        "1": "8 small slender Japanese or Garnet sweet potatoes (4 to 5 pounds total)",
        "2": "1 1/2 sticks unsalted butter, well softened",
        "3": "1 1/2 tablespoons miso paste (preferably white)",
        "4": "3 tablespoons finely chopped scallion"
      },
      "Instructions": "Preheat oven to 450°F with rack in upper third.\nPrick potatoes all over with a fork and put on a foil-lined large baking sheet. Bake until very soft when squeezed, 45 minutes to 1 hour.\nWhile potatoes bake, stir together butter, miso, and scallion until combined.\nSlit hot potatoes lengthwise and, using oven mitts, push in sides to puff up potato. Serve with some scallion butter in center of each and with additional scallion butter on the side.",
      "Image": "//20fix.com/xfood/img/roasted-japanese-sweet-potatoes-with-scallion-butter-240549.jpg"
    },
    {
      "id": "13450",
      "Title": "Japanese Beef and Scallion Rolls",
      "Ingredients": {
        "1": "12 small scallions, trimmed to 6-inch lengths",
        "2": "1 (1-lb) piece flank steak (roughly 6 to 7 inches square)",
        "3": "1/4 cup sake (Japanese rice wine)",
        "4": "1/4 cup mirin* (Japanese sweet rice wine)",
        "5": "3 tablespoons soy sauce",
        "6": "1 tablespoon sugar",
        "7": "1 tablespoon vegetable oil",
        "8": "a meat pounder; kitchen string"
      },
      "Instructions": "Blanch scallions in a pot ofboiling salted water 45 seconds, then transfer with a slotted spoon to a bowl of ice and cold water to stop cooking. Transfer scallions to paper towels to drain and pat dry.\nCut flank steak with the grain holding a large knife at a 30-degree angle to cutting board into 12 (1/8-inch-thick) slices (1 1/2 to 2 inches wide). Arrange slices 1 inch apart on a very lightly oiled sheet of parchment paper or plastic wrap, then cover with another very lightly oiled sheet of parchment or plastic wrap (oiled side down) and pound slices with flat side of meat pounder until about 1/16 inch thick.\nArrange 3 beef slices side by side on a fresh sheet of plastic wrap, overlapping slices slightly to form a 6-inch square with short ends of slices nearest you. Sprinkle square lightly with a pinch of salt, then lay 3 scallions (with some white parts at both ends) across slices at end closest to you and tightly roll up meat around scallions to form a log, using plastic wrap as an aid. Tie log with kitchen string at ends and where meat slices overlap. Make 3 more negimaki rolls in same manner.\nStir together sake, mirin, soy sauce, and sugar in a small bowl until sugar is dissolved.\nPut rolls in a small baking dish and pour marinade over them, turning to coat. Marinate, loosely covered with plastic wrap, turning occasionally, 15 minutes.\nHeat a 10-inch heavy skillet over moderately high heat until hot, 1 to 2 minutes. While skillet is heating, lift rolls out of marinade, letting excess drip off, and pat dry. (Save marinade.) Add oil to skillet, swirling to coat bottom, then cook rolls, turning with tongs, until well browned on all sides, 4 to 5 minutes total for medium-rare. Transfer rolls to cutting board. Add marinade to skillet and boil until slightly syrupy, 1 to 2 minutes, then remove from heat.\nCut off and discard strings, then cut each roll crosswise into 6 slices. Pour sauce into a shallow serving dish and arrange negimaki in sauce.\n*Available at Asian markets, some supermarkets, and Uwajimaya (800-889-1928)",
      "Image": "//20fix.com/xfood/img/japanese-beef-and-scallion-rolls-109190.jpg"
    }
  ],
  "t": 16,
  "p": {
    "limitstart": 0,
    "limit": 25,
    "total": 16,
    "pagesStart": 1,
    "pagesStop": 1,
    "pagesCurrent": 1,
    "pagesTotal": 1
  }
}