{
  "s": 1,
  "d": [
    {
      "id": "75",
      "Title": "Dakgangjeong (닭강정 / Korean Sweet, Crunchy Fried Chicken)",
      "Ingredients": {
        "1": "2 ½ pounds chicken wingettes or dumettes or small pieces of chicken (see headnote)",
        "2": "¼ teaspoon kosher salt",
        "3": "¼ teaspoon ground black pepper",
        "4": "½ cup potato starch",
        "5": "Vegetable oil",
        "6": "⅓ cup toasted peanuts (optional)",
        "7": "½ cup rice syrup or honey",
        "8": "3 tablespoons soy sauce",
        "9": "2 tablespoons brown or white sugar",
        "10": "2 teaspoons white vinegar",
        "11": "2 teaspoons yellow mustard",
        "12": "2 tablespoons vegetable oil",
        "13": "3 garlic cloves, mined",
        "14": "1 teaspoon minced peeled ginger",
        "15": "8 small dried red chili peppers",
        "16": "2 teaspoons toasted sesame seeds",
        "17": "2 to 3 teaspoons crushed red pepper flakes (optional)"
      },
      "Instructions": "Mix the chicken pieces, salt, and black pepper in a large bowl. Transfer to a large zipper-lock bag, add the potato starch, close the bag, and mix well by flipping the bag over and back again until the chicken is well coated.\nPlace a large mesh strainer over a bowl.\nHeat 2 inches vegetable oil in a large, deep pan or wok over medium-high heat until it reaches about 340°F, 8 to 10 minutes. If you don’t have a thermometer, test it by dipping a tip of a chicken piece into the oil. If it bubbles, it’s ready. Carefully add the chicken to the oil one piece at a time, working in batches to avoid overcrowding.\nDeep-fry, turning the chicken with tongs, until all sides are light golden brown and crunchy, 10 to 12 minutes. As each piece is done, transfer it to the strainer. Once the chicken has drained, transfer it to a large bowl. Repeat with the rest of the chicken, making sure to bring the oil back up to 340°F between batches.\nReturn the oil to 340°F over high heat and carefully add all the chicken—there’s no need to work in batches this time. The chicken will look a little soggy at first. Deep-fry, turning occasionally, until all the chicken pieces are dark golden brown and very crunchy, another 10 to 13 minutes. Transfer the chicken pieces to the strainer or a rack to drain, then place in a large bowl.\nIf using the peanuts, place them in a slotted spoon or a small mesh strainer, carefully dip them into the hot oil, and fry for 15 to 30 seconds, just until light golden brown. Transfer to a small bowl.\nMix the rice syrup, soy sauce, sugar, vinegar, and mustard in a small bowl.\nHeat a large pan or wok over medium-high heat. Add the oil, garlic, ginger, and chili peppers and stir for 30 seconds to 1 minute, until the garlic is a little crispy and fragrant. Add the soy sauce mixture and stir. Let it bubble for 2 to 3 minutes, until the mixture is shiny and a little sticky. Remove from the heat if not using right away and reheat until bubbling when ready to finish the chicken.\nAdd the chicken and peanuts (if using) to the bubbling sauce and toss with a wooden spoon to coat nicely. Sprinkle with the toasted sesame seeds and a few teaspoons crushed red pepper flakes (if using). Transfer to a large plate or platter and serve. The chicken will remain crunchy for several hours if left at room temperature, or you can cover and refrigerate it for up to 3 days.",
      "Image": "//20fix.com/xfood/img/dakgangjeong-korean-sweet-crunchy-fried-chicken-maangchi.jpg"
    },
    {
      "id": "196",
      "Title": "Kong Jaban (Korean Sweet Black Beans)",
      "Ingredients": {
        "1": "1¼ cups dried black beans, rinsed and picked over",
        "2": "2 quarts dashi or water, plus more if needed",
        "3": "1 cup soy sauce",
        "4": "¾ cup sugar",
        "5": "2 tablespoons toasted sesame oil",
        "6": "1 tablespoon toasted sesame seeds"
      },
      "Instructions": "Soak the beans in enough water to cover them by 3 inches in a covered container in the refrigerator for 8 to 12 hours.\nDrain the beans, put them in a pot, and add the dashi or water and soy sauce. Set over medium-high heat and bring the liquid to a simmer. Adjust the heat to maintain a gentle simmer and cook for 1 hour, stirring the beans on a regular basis. The level of liquid will reduce as the beans cook; once it gets to the point where it does not completely cover the beans, you will need to stir more often to ensure that the beans cook evenly. After an hour, the beans should be tender but still retain a little bite. If they are still hard, add more dashi or water and cook for 15 to 20 minutes longer, until the beans are tender with a little bite.\nAdd the sugar, sesame oil, and sesame seeds to the pot and mix well. (It’s important to wait to add the sugar until the beans are tender, as adding it in the beginning will cause the beans to harden when refrigerated.) Let the beans cool slightly, then transfer to an airtight container and refrigerate until chilled. (The beans will keep for up to 2 weeks in the refrigerator.)\nServe the beans cold with hot rice.",
      "Image": "//20fix.com/xfood/img/korean-stewed-sweet-black-beans-kong-jaban.jpg"
    },
    {
      "id": "575",
      "Title": "Korean Egg Bread (Gyeran Bbang)",
      "Ingredients": {
        "1": "250g (9oz) plain flour",
        "2": "2 tsp baking powder",
        "3": "1/2 tsp sea salt",
        "4": "250ml (8fl oz) whole milk",
        "5": "2 tsp butter, melted",
        "6": "2 eggs, beaten",
        "7": "9 egg yolks",
        "8": "120g (3 1/4 oz) bacon, diced",
        "9": "90g (3oz) tomato, diced",
        "10": "120g (3 1/4 oz) mozzarella cheese, grated",
        "11": "Sea salt and freshly ground black pepper",
        "12": "15g (1/2 oz) chives, chopped, to serve"
      },
      "Instructions": "Preheat the oven to 180°C fan/200°C/400°F/gas 6 and line a nine-hole muffin tin with paper cases.\nFor the batter, put the flour, baking powder, salt and pepper in a large bowl. Mix well.\nIn another bowl, whisk together the milk, butter and eggs.\nMake a well in the center of the dry mixture and pour the wet mixture into it. Gradually whisk it all together until fully blended and smooth.\nDivide the mixture between the holes of the muffin tin and add an egg yolk to the top of each one. Sprinkle a little bacon, tomato, cheese and a pinch of salt over each one.\nBake the bread for 20–25 minutes, until set and golden brown. Sprinkle with chopped chives and serve immediately.",
      "Image": "//20fix.com/xfood/img/korean-egg-bread-gyeran-bbang.jpg"
    },
    {
      "id": "638",
      "Title": "Korean-Style Grilled Wings with Cucumber-Kimchi Salad",
      "Ingredients": {
        "1": "1/4 cup pear or apple juice",
        "2": "3 Tbsp. low-sodium soy sauce or tamari",
        "3": "2 Tbsp. gochugaru (Korean hot pepper flakes) or 1 1/2 tsp. crushed red pepper flakes",
        "4": "2 Tbsp. toasted sesame oil",
        "5": "1 Tbsp. finely grated fresh ginger (from one 2\" piece)",
        "6": "1 tsp. light brown sugar",
        "7": "2 garlic cloves, coarsely chopped",
        "8": "2 lb. chicken wings, flats and drumettes attached or separated",
        "9": "2 tsp. kosher salt, divided",
        "10": "4 Persian cucumbers, thinly sliced",
        "11": "1 cup kimchi, thinly sliced",
        "12": "2 Tbsp. rice vinegar",
        "13": "4 scallions, thinly sliced, divided",
        "14": "Toasted sesame seeds and steamed rice (for serving)"
      },
      "Instructions": "Blend pear juice, soy sauce, gochugaru, sesame oil, ginger, brown sugar, and garlic in a blender until smooth.\nSeason wings on all sides with 1 tsp. salt, then transfer to a large resealable bag. Pour two-thirds of marinade over chicken in bag, seal, and toss to coat. Transfer remaining marinade to a small bowl and chill. Let chicken sit at room temperature at least 20 minutes or chill overnight.\nPrepare a grill for medium heat or heat a grill pan over medium. Working in batches if needed, grill wings, turning occasionally, until skin is crisp and lightly charred, 15–20 minutes.\nMeanwhile, let reserved marinade come to room temperature. Toss cucumbers, kimchi, vinegar, all but a small handful of scallions (save those for topping), and remaining 1 tsp. salt in a large bowl. Let sit 10–20 minutes. Top with sesame seeds.\nTransfer wings to a medium bowl. Add reserved marinade and toss to combine. Serve wings with cucumber-kimchi salad and rice alongside. Top with reserved scallions.",
      "Image": "//20fix.com/xfood/img/korean-style-grilled-wings-with-cucumber-kimchi-salad.jpg"
    },
    {
      "id": "1465",
      "Title": "Instant-Pot Korean Chile-Braised Brisket and Kimchi Coleslaw",
      "Ingredients": {
        "1": "4 to 5 pounds beef brisket, cut into 3 or 4 pieces",
        "2": "1 tablespoon dried red chile flakes, preferably Korean gochugaru",
        "3": "1 tablespoon sweet paprika",
        "4": "2 1/2 teaspoons kosher salt, plus more to taste",
        "5": "1/2 teaspoon freshly ground black pepper",
        "6": "1 to 3 tablespoons peanut or safflower oil, as needed",
        "7": "1 large onion, diced",
        "8": "4 garlic cloves, minced",
        "9": "1 tablespoon grated peeled fresh ginger",
        "10": "1 cup lager-style beer",
        "11": "1/4 cup gochujang (Korean chile paste) or Sriracha",
        "12": "2 tablespoons ketchup",
        "13": "2 tablespoons soy sauce",
        "14": "2 tablespoons light or dark brown sugar",
        "15": "2 teaspoons Asian fish sauce",
        "16": "1 teaspoon toasted sesame oil",
        "17": "5 cups shredded cabbage (from 1 small cabbage)",
        "18": "1/4 cup chopped kimchi, plus more to taste",
        "19": "2 tablespoons peanut, grapeseed, or olive oil",
        "20": "1 teaspoon toasted sesame oil",
        "21": "Juice of 1/2 lime, plus more to taste",
        "22": "1/2 teaspoon fine sea salt, plus more to taste"
      },
      "Instructions": "Rub the beef with the chile flakes, paprika, salt, and pepper. Cover and refrigerate for 1 hour and up to 24 hours.\nSet the electric pressure cooker to sauté (or use a large skillet). Add a tablespoon of the oil, let it heat up for a few seconds, and then add a batch of the beef and sear until it’s browned all over, about 2 minutes per side, adding more oil as needed. Transfer the beef to a plate and repeat with the remaining batches.\nIf the pot looks dry, add a bit more oil. Add the onion and sauté until golden, 3 to 5 minutes. Add the garlic and ginger and sauté for 1 minute longer. Add the beer, gochujang, ketchup, soy sauce, brown sugar, fish sauce, and sesame oil. Scrape the mixture into the pressure cooker if you have used a skillet.\nCover and cook on high pressure for 90 minutes. Let the pressure release naturally for 20 minutes, and then release the remaining pressure manually.\nTo make the kimchi coleslaw, combine the cabbage, kimchi, both oils, lime juice, and salt in a large bowl and toss well. Taste, and add more salt or lime juice if needed.\nTransfer the beef to a plate or a rimmed cutting board and tent with foil to keep warm. Set the pressure cooker to sauté and simmer the sauce for 15 to 20 minutes, until it is reduced by half or two-thirds (remember that it thickens as it cools). Use a fat separator to skim off the fat, or let the sauce settle and spoon the fat off the top. Serve the sauce alongside the beef, with the kimchi coleslaw.\nCut the beef into 6 to 8 pieces instead of 3 or 4 pieces. Marinate and brown as in steps 1 and 2. Place the meat in the pot and cover with the sautéed onion mixture from step 3. Cook on high for 7 to 9 hours or low for 10 to 12 hours.",
      "Image": "//20fix.com/xfood/img/instant-pot-korean-chile-braised-brisket-and-kimchi-coleslaw-melissa-clark.jpg"
    },
    {
      "id": "1531",
      "Title": "Good Luck Beef and Korean Rice Cake Soup (Tteokguk)",
      "Ingredients": {
        "1": "1 1/2-pound piece point- or flat-cut beef brisket or stew meat, fat trimmed",
        "2": "1 teaspoon toasted sesame oil",
        "3": "1 tablespoon plus 2 teaspoons vegetable oil",
        "4": "Kosher salt",
        "5": "4 scallions",
        "6": "1 (3-inch) piece ginger, peeled",
        "7": "4 garlic cloves, finely grated",
        "8": "1/3 Korean radish, peeled, quartered lengthwise, sliced crosswise 1/2\" thick, or 1/2 medium daikon, halved lengthwise, sliced crosswise 1/2\" thick",
        "9": "4 large eggs",
        "10": "8–10 ounces Korean rice cakes (tteok), sliced",
        "11": "2 teaspoons fish sauce",
        "12": "Freshly ground black pepper",
        "13": "Korean red chile threads (optional; for serving)"
      },
      "Instructions": "Cut meat into 1 1/2\" pieces. Heat sesame oil and 1 Tbsp. vegetable oil in a large pot over medium-high. Add meat and season with salt. Cook, turning occasionally, until browned on all sides, 8–12 minutes.\nMeanwhile, separate scallion whites from greens and coarsely chop; set aside. Thinly slice scallion greens and set aside separately for serving.\nUsing a flat-bottomed mug or the side of a chef’s knife, lightly smash ginger. Add to pot along with garlic, reserved scallion whites, and 16 cups cold water and bring to a boil. Reduce heat and simmer, skimming any foam from surface, until meat is tender, 60–75 minutes, if using stew meat, or up to 2 hours , if using brisket. Transfer meat to a plate with a slotted spoon, then scoop out ginger and scallion whites and discard.\nAdd Korean radish to pot and simmer until tender but not mushy (it should still hold its shape), 12–15 minutes.\nMeanwhile, heat 1 tsp. vegetable oil in a medium nonstick skillet over medium. Whisk eggs in a medium bowl and season with a large pinch of salt. Pour half of eggs into the center of skillet and quickly swirl pan to distribute evenly. Cook eggs undisturbed until they are just set, about 2 minutes. Carefully loosen with a heatproof rubber spatula, flip, and cook until other side is just set, about 1 minute. Slide egg crepe onto a cutting board and fold in half; let cool. Slice into 1/4\"-thick ribbons. Repeat with remaining eggs and 1 tsp. vegetable oil.\nSlice beef as thin as you can and return to pot; add rice cakes. Cook until rice cakes are soft, about 5 minutes. Stir in fish sauce; taste and season soup with more salt and a few grinds of pepper.\nLadle soup into bowls and top with sliced egg, reserved scallion greens, and chile threads (if using).\nSoup (without garnishes) can be made 2 days ahead. Let cool; cover and chill. Reheat over medium before serving.",
      "Image": "//20fix.com/xfood/img/good-luck-beef-and-korean-rice-cake-soup-tteokguk.jpg"
    },
    {
      "id": "1754",
      "Title": "Spicy Korean Steak Tacos with Kimchi",
      "Ingredients": {
        "1": "2 (1 1/2-inch/4-cm–thick) rump steaks or boneless sirloin steaks (700g)",
        "2": "1 tablespoon extra virgin olive oil",
        "3": "2 cups (600g) coarse salt",
        "4": "Cracked black pepper",
        "5": "2 tablespoons oyster sauce",
        "6": "1 tablespoon Chinese cooking wine (Shaoxing)",
        "7": "1 tablespoon finely grated ginger",
        "8": "1 teaspoon dried chile flakes",
        "9": "1 tablespoon finely grated palm sugar or brown sugar",
        "10": "16 small flour tortillas, lightly toasted",
        "11": "1/2 cup (150g) Japanese mayonnaise",
        "12": "2 cups (160g) finely shredded daikon",
        "13": "1 cup (200g) store-bought kimchi",
        "14": "1/2 cup coriander (cilantro) leaves"
      },
      "Instructions": "Rub the steaks with the oil. Spread half the rock salt over a tray, top with the steaks and cover with the remaining salt. Set aside for 20 minutes.\nMeanwhile make the spicy ginger sauce: Place the oyster sauce, cooking wine, ginger, chile flakes and sugar in a small bowl and mix until the sugar has dissolved.\nWipe all the salt from the steaks, using paper towel, and sprinkle with pepper.\nPreheat a grill pan or barbecue over high heat.\nCook the steaks, turning every 1 minute, for 2–3 minutes each side or until cooked to your liking. In the last 30 seconds of cooking time, brush the steaks with the spicy ginger sauce and turn to caramelize both sides.\nCover gently with aluminum foil and allow to rest for 5 minutes. Thinly slice the steaks. Spread the tortillas with the mayonnaise. Top with the daikon, steak, kimchi and cilantro to serve.",
      "Image": "//20fix.com/xfood/img/spicy-korean-steak-tacos-with-kimchi.jpg"
    },
    {
      "id": "1896",
      "Title": "3-Ingredient Korean Grilled Chicken Wings with Scallion",
      "Ingredients": {
        "1": "2 pounds chicken wings (flats and drumettes attached or separated)",
        "2": "1 tablespoon vegetable oil",
        "3": "1 teaspoon kosher salt, plus more",
        "4": "1/2 teaspoon freshly ground black pepper, plus more",
        "5": "1/2 cup gochujang (Korean hot pepper paste)",
        "6": "1 scallion, thinly sliced on the bias"
      },
      "Instructions": "Pat wings very dry with paper towels. Toss wings, oil, 1 tsp. salt, and 1/2 tsp. pepper in a large bowl to coat.\nPrepare a grill for two zones, medium and medium-high, or heat a grill pan over medium. Working in batches if necessary, grill wings over medium heat, turning occasionally, until skin is starting to brown and fat is rendering, about 12 minutes. Move wings to medium-high zone of grill or increase heat under grill pan to medium-high. Cook wings, moving to a cooler section of grill or reducing heat if they start to burn, until cooked through, an instant-read thermometer inserted into the flesh but not touching the bone registers 165°F, and skin is crisp and lightly charred, 5–10 minutes.\nMeanwhile, whisk gochujang and 1/4 cup hot water in a large bowl.\nTransfer wings to bowl with gochujang and toss to coat. Transfer to a platter. Top with scallions, season with salt and pepper, and serve immediately.",
      "Image": "//20fix.com/xfood/img/3-ingredient-korean-grilled-chicken-wings-with-scallion.jpg"
    },
    {
      "id": "1953",
      "Title": "Korean Fried Chicken",
      "Ingredients": {
        "1": "Vegetable or canola oil (for frying; about 2 quarts)",
        "2": "2 teaspoons sesame seeds",
        "3": "1 tablespoon toasted sesame oil",
        "4": "1 tablespoon finely chopped peeled fresh ginger",
        "5": "2 scallions, white and green parts separated, thinly sliced",
        "6": "1/2 cup gochujang (Korean hot pepper paste)",
        "7": "1 tablespoon light brown sugar",
        "8": "1/2 cup cornstarch",
        "9": "1/2 cup unbleached all-purpose flour",
        "10": "2 teaspoons kosher salt",
        "11": "1 teaspoon baking powder",
        "12": "Freshly ground black pepper",
        "13": "1/2 cup vodka",
        "14": "2 pounds boneless, skinless chicken thighs, quartered",
        "15": "A deep-fry thermometer"
      },
      "Instructions": "Set a wire rack inside a rimmed baking sheet and place near stove. Set deep-fry thermometer in a heavy wide pot, then pour in oil to a depth of 1 1/2\". Heat over high until thermometer registers 350ºF.\nMeanwhile, toast sesame seeds in a small skillet over medium-low heat, stirring frequently, until lightly golden, 3–5 minutes. Transfer to a plate and let cool; set aside.\nHeat sesame oil in same skillet over medium. Add ginger and scallion whites. Cook, stirring frequently, until scallions are tender, about 1 minute. Whisk in gochujang and brown sugar, bring just to a simmer, then remove from heat. Add 1/4 cup water; whisk to combine. Transfer sauce to a large bowl and cover to keep warm; set aside.\nWhisk cornstarch, flour, salt, baking powder, and a generous pinch of pepper in another large bowl. Add vodka and 1/2 cup cold water, then whisk until a smooth, loose batter forms. Add chicken and toss to coat.\nUsing tongs, remove chicken from batter, letting excess drip back into bowl. Transfer to hot oil and cook, working in batches if needed, stirring occasionally with a slotted spoon to keep pieces from sticking together, and adjusting heat as needed to maintain 350ºF, until chicken is golden and crispy, 6–8 minutes per batch.\nTransfer fried chicken to prepared rack. Add chicken to reserved sauce and carefully toss to coat. Transfer to a serving platter. Top with reserved toasted sesame seeds and scallion greens.",
      "Image": "//20fix.com/xfood/img/korean-fried-chicken.jpg"
    },
    {
      "id": "2871",
      "Title": "Korean-Style Grain Bowls with Spicy Marinated Steak",
      "Ingredients": {
        "1": "1 cup pear juice",
        "2": "1/2 cup low-sodium soy sauce",
        "3": "1/2 cup rice wine vinegar",
        "4": "1/4 cup neutral vegetable oil, such as grapeseed",
        "5": "3 garlic cloves, finely grated",
        "6": "2 tablespoons toasted sesame oil",
        "7": "1 tablespoon finely grated ginger",
        "8": "1 teaspoon gochujang or Sriracha",
        "9": "1 teaspoon light brown sugar",
        "10": "1/4 teaspoon kosher salt",
        "11": "2 teaspoons gochujang or Sriracha",
        "12": "1 teaspoon light brown sugar",
        "13": "1/2 teaspoon kosher salt",
        "14": "1 1/2 pounds (1/2\"-thick) flanken-cut, bone-in short ribs or 1 pound (1/2\"-thick) boneless rib eye",
        "15": "1 tablespoon neutral vegetable oil, such as grapeseed",
        "16": "1 1/2 cups thinly sliced purple cabbage",
        "17": "2 tablespoons rice wine vinegar, divided",
        "18": "1 large carrot, julienned with a mandolin or coarsely grated using the large holes of a box grater",
        "19": "4 cups baby spinach",
        "20": "4 cups cooked grains, such as farro, quinoa, and/or brown rice",
        "21": "1/2 teaspoon kosher salt",
        "22": "6 ounces sugar snap peas, trimmed, strings removed, or snow peas, blanched",
        "23": "1/2 cup kimchi, preferably daikon radish, sliced (optional)",
        "24": "4 fried eggs (optional)",
        "25": "1 scallion, thinly sliced",
        "26": "2 teaspoons toasted sesame seeds",
        "27": "Gochujang or Sriracha (for serving)"
      },
      "Instructions": "Whisk pear juice, soy sauce, vinegar, vegetable oil, garlic, sesame oil, ginger, gochujang, brown sugar, and salt in a medium bowl.\nPour 1 cup marinade into a large resealable bag or bowl; reserve remaining marinade. Whisk in gochujang, brown sugar, and salt. Add steak and toss to coat, then let rest at room temperature at least 1 hour.\nHeat oil in a large skillet over medium-high. Remove steak from marinade and pat dry; discard marinade. Cook steak until an instant-read thermometer inserted into the center registers 125°F, 2–3 minutes per side for medium rare. Transfer to a cutting board and let rest 10 minutes before slicing against the grain.\nToss cabbage, 1 Tbsp. marinade, and 1 Tbsp. vinegar in a small bowl. Toss carrots, 1 Tbsp. marinade, and remaining 1 Tbsp. vinegar in another small bowl. Let rest at least 10 minutes.\nToss spinach, grains, and salt with 1/2 cup marinade in a large bowl. Divide among 4 bowls. Top with beef, cabbage, carrots, peas, and kimchi, if using. Place 1 fried egg in the center of each bowl, if using. Top with scallion and sesame seeds. Serve with gochujang and remaining marinade alongside.\nSteak can be marinated 10 hours ahead; chill in bag. Let steak come to room temperature at least 1 hour before cooking. Cabbage and carrots can be marinated 1 day ahead; cover and chill.",
      "Image": "//20fix.com/xfood/img/korean-style-grain-bowls-with-spicy-marinated-steak.jpg"
    },
    {
      "id": "3515",
      "Title": "Korean Marinated Beef (Bulgogi)",
      "Ingredients": {
        "1": "1/4 cup soy sauce",
        "2": "1 tablespoon sugar",
        "3": "2 teaspoons Asian sesame oil",
        "4": "1 bunch scallions (white and pale green parts separated from greens), minced (1/2 cup)",
        "5": "1 tablespoon minced garlic",
        "6": "1 tablespoon minced peeled fresh ginger",
        "7": "3 tablespoons sesame seeds, toasted",
        "8": "1 lb flank steak, cut across the grain into very thin slices (no more than 1/8 inch thick)",
        "9": "1 tablespoon vegetable oil",
        "10": "Accompaniments: butter lettuce or other soft-leaf lettuce; thinly sliced garlic; packaged kimchi*; steamed white rice"
      },
      "Instructions": "Stir together soy sauce, sugar, sesame oil, white and pale green scallions, garlic, ginger, and 2 tablespoons sesame seeds in a bowl until sugar is dissolved. Add steak and toss to coat, then marinate 15 minutes.\nHeat vegetable oil in a 12-inch heavy skillet over high heat until just smoking, then add steak in 1 layer and sauté, turning over occasionally, until browned and just cooked through, about 5 minutes total. Transfer to a platter and sprinkle with scallion greens and remaining 1 tablespoon sesame seeds, then serve with accompaniments.\n*Available at Asian markets and many supermarkets.",
      "Image": "//20fix.com/xfood/img/korean-marinated-beef-109206.jpg"
    },
    {
      "id": "4842",
      "Title": "Korean Steak Tacos",
      "Ingredients": {
        "1": "1/2 cup finely chopped fresh cilantro",
        "2": "1/4 cup packed dark brown sugar",
        "3": "3 tablespoons canola oil",
        "4": "3 tablespoons soy sauce",
        "5": "1 tablespoon toasted sesame oil",
        "6": "2 large garlic cloves, minced",
        "7": "1 jalapeño pepper, seeded and finely chopped",
        "8": "1 teaspoon freshly ground black pepper",
        "9": "1 teaspoon ground coriander",
        "10": "One 2-pound flank steak (about 1 1/2 inches thick), fat trimmed",
        "11": "1/2 head napa cabbage, halved lengthwise and shredded crosswise (about 3 cups)",
        "12": "1 large carrot, cut into 2-inch-long matchstick-size strips",
        "13": "8 scallions (white and green parts), thinly sliced on a sharp diagonal",
        "14": "1/2 cup lightly packed fresh cilantro sprigs",
        "15": "Twelve 6-inch corn tortillas",
        "16": "Guacamole for Lindsay"
      },
      "Instructions": "1. To marinate the steak: In a large baking dish, whisk the cilantro, brown sugar, canola oil, soy sauce, sesame oil, garlic, jalapeños, black pepper, and coriander to blend well. Reserve 1/4 cup of the mixture in a small bowl for serving. Place the steak in the remaining marinade and turn to coat. Marinate for at least 20 minutes at room temperature, or cover and refrigerate for up to 1 day, turning occasionally. Cover and refrigerate the reserved marinade.\n2. Prepare an outdoor grill for medium-high cooking over direct heat.\n3. Remove the steak from the marinade (discard the marinade) and grill, turning halfway through cooking, for a total of about 10 minutes, until the meat feels only slightly resilient when pressed with a fingertip for medium-rare. Transfer the steak to a cutting board and let stand for 5 to 10 minutes.\n4. Meanwhile, prepare the tacos: In a large bowl, toss the cabbage, carrots, scallions, and cilantro together.\n5. Heat the tortillas on the grill, turning occasionally, for about 1 minute, or until hot. Transfer to a serving bowl and cover to keep warm.\n6. To serve: Cut the steak across the grain into 1/4-inch-thick slices. Transfer the steak slices and any carving juices to a platter. Serve the steak with the reserved marinade, tortillas, cabbage mixture, and guacamole. Let each guest fill two tortillas with some steak and cabbage mixture and top with some of the marinade and guacamole.",
      "Image": "//20fix.com/xfood/img/korean-steak-tacos-51221610.jpg"
    },
    {
      "id": "6790",
      "Title": "Korean Steak Tartare",
      "Ingredients": {
        "1": "1 Asian pear, cored, quartered",
        "2": "1 1/4 teaspoons fresh lemon juice, divided",
        "3": "2 tablespoons finely chopped scallions",
        "4": "2 tablespoons reduced-sodium soy sauce",
        "5": "2 teaspoons toasted sesame seeds, divided",
        "6": "1 1/2 teaspoons toasted sesame oil",
        "7": "1 garlic clove, finely grated",
        "8": "1/8 teaspoon freshly ground black pepper",
        "9": "8 ounces filet mignon, cut into very small cubes (about 1/8\")",
        "10": "Kosher salt",
        "11": "2\" pieces of chives"
      },
      "Instructions": "Peel 1 pear quarter; cut into very small cubes (about 1/8\"). Place in a small bowl and toss with 1/4 teaspoon lemon juice. Cut remaining pear quarters into thin slices. Place in a medium bowl and toss with remaining 1 teaspoon lemon juice.\nWhisk scallions, soy sauce, 1 teaspoon sesame seeds, sesame oil, garlic, and pepper in a medium bowl. Add filet mignon and pear cubes and gently toss until just combined; season to taste with salt.\nNeatly spoon tartare over pear slices. Sprinkle with remaining 1 teaspoon sesame seeds and garnish with chives.",
      "Image": "//20fix.com/xfood/img/korean-steak-tartare-367760.jpg"
    },
    {
      "id": "6982",
      "Title": "Korean BBQ Marinade",
      "Ingredients": {
        "1": "1/2 cup reduced-sodium soy sauce",
        "2": "2 tablespoons water",
        "3": "1 1/2 tablespoons raw or turbinado sugar",
        "4": "1 tablepsoon minced garlic",
        "5": "1 teaspoon Asian sesame oil",
        "6": "1 teaspoon grated peeled fresh ginger",
        "7": "1/2 teaspoon freshly ground black pepper",
        "8": "1/2 cup chopped scallions"
      },
      "Instructions": "Whisk 1/2 cup reduced-sodium soy sauce, 2 tablespoons water, 1 1/2 tablespoons raw or turbinado sugar, 1 tablespoon minced garlic, 1 teaspoon Asian sesame oil, 1 teaspoon grated peeled fresh ginger, and 1/2 teaspoon freshly ground black pepper in a medium bowl. Stir in 1/2 cup chopped scallions. DO AHEAD: Cover and chill up to 1 day.",
      "Image": "//20fix.com/xfood/img/korean-bbq-marinade-366435.jpg"
    },
    {
      "id": "7901",
      "Title": "Korean Rice Bowl with Steak, Asparagus, and Fried Egg",
      "Ingredients": {
        "1": "1 tablespoon sesame seeds",
        "2": "3/4 teaspoon fleur de sel",
        "3": "1/2 teaspoon New Mexico chile powder",
        "4": "1 1/2 pounds New York strip steak, trimmed",
        "5": "1/4 cup soy sauce",
        "6": "3 tablespoons Asian sesame oil, divided",
        "7": "2 green onions, finely chopped",
        "8": "2 tablespoons sugar",
        "9": "1 tablespoon sake or dry Sherry",
        "10": "1 garlic clove, minced",
        "11": "1 1/2 pounds slender asparagus spears, trimmed",
        "12": "2 teaspoons vegetable oil plus additional for brushing",
        "13": "6 large eggs",
        "14": "6 cups freshly cooked medium-grain white rice",
        "15": "Korean hot pepper paste (kochujang)",
        "16": "Kimchi"
      },
      "Instructions": "Toast sesame seeds in small skillet over medium heat until golden brown, stirring often, about 3 minutes. Transfer sesame seeds to small bowl to cool. Grind sesame seeds, fleur de sel, and chile powder in mortar with pestle or in spice mill until about half of sesame seeds are finely ground. Return to same small bowl. DO AHEAD: Sesame salt can be made 1 day ahead. Cover and let stand at room temperature.\nPlace steak in freezer 1 hour for easy slicing. Cut steak crosswise into 1/8-inch-thick slices. Whisk soy sauce, 2 tablespoons sesame oil, green onions, sugar, sake, and garlic in medium bowl. Toss steak in soy mixture. Let marinate at room temperature 30 minutes, tossing occasionally.\nHeat griddle or 2 heavy large skillets over medium-high heat. Toss asparagus with 2 teaspoons vegetable oil on large rimmed baking sheet. Sauté asparagus until crisp-tender, about 4 minutes. Return to rimmed baking sheet. Sprinkle sesame salt over; drizzle with remaining 1 tablespoon sesame oil. Tent with foil to keep warm.\nBrush griddle with vegetable oil. Working in batches, grill steak until just browned, about 1 minute per side. Transfer to bowl; tent with foil to keep warm. Brush griddle with vegetable oil. Crack eggs onto hot griddle. Cook until whites are set but yolks are still runny, 2 to 3 minutes.\nDivide warm rice among bowls. Divide asparagus, then beef among bowls, placing atop rice. Top with fried egg. Serve with Korean hot pepper paste and kimchi.",
      "Image": "//20fix.com/xfood/img/korean-rice-bowl-with-steak-asparagus-and-fried-egg-358210.jpg"
    },
    {
      "id": "9017",
      "Title": "Korean-Style Romaine",
      "Ingredients": {
        "1": "1 heart of romaine",
        "2": "1 teaspoon chopped garlic",
        "3": "1/2 teaspoon grated peeled ginger",
        "4": "1/4 teaspoon coarse Korean hot red-pepper flakes",
        "5": "1 tablespoon Asian sesame oil",
        "6": "1 tablespoon soy sauce",
        "7": "2 teaspoons water",
        "8": "1 teaspoon sesame seeds, toasted and crushed with side of a heavy knife"
      },
      "Instructions": "Cut romaine crosswise into 2-inch pieces and put in a bowl.\nCook garlic, ginger, and red-pepper flakes in sesame oil in a small heavy skillet over medium-low heat, stirring, until garlic begins to sizzle, about 30 seconds. Stir in soy sauce and water and bring to a boil.\nPour hot dressing over romaine and toss to coat. Sprinkle with sesame seeds. Marinate, stirring occasionally, at least 30 minutes.",
      "Image": "//20fix.com/xfood/img/korean-style-romaine-351894.jpg"
    },
    {
      "id": "10661",
      "Title": "Steak and Eggs Korean Style",
      "Ingredients": {
        "1": "1/4 cup mirin (sweet Japanese rice wine)*",
        "2": "2 tablespoons finely grated cored peeled Granny Smith apple",
        "3": "2 tablespoons soy sauce",
        "4": "2 tablespoons light corn syrup",
        "5": "1 1/2 tablespoons finely chopped green onion (white and pale green parts)",
        "6": "1 tablespoon (scant) Korean hot pepper paste",
        "7": "1 tablespoon (scant) minced peeled fresh ginger",
        "8": "2 garlic cloves, minced",
        "9": "1 1/2 teaspoons Asian sesame oil",
        "10": "1 1/2 teaspoons unseasoned rice vinegar",
        "11": "4 5-ounce pieces skirt steak",
        "12": "2 cups water",
        "13": "1 cup sushi rice (or other short-grain rice)",
        "14": "1 teaspoon salt",
        "15": "2 tablespoons plus 1 teaspoon canola oil",
        "16": "1 1/2 cups Napa cabbage kimchi, coarsely chopped",
        "17": "2 tablespoons unseasoned rice vinegar",
        "18": "4 large eggs",
        "19": "Chopped green onions"
      },
      "Instructions": "Korean hot pepper paste (gochu jang or kochujang) is made with pureed fermented soybeans (miso) and hot chiles. Kimchi is a spicy and pungent fermented vegetable mixture; this recipe calls for the version made with Napa cabbage. Both can be found at Korean markets and online at koamart.com.\nWhisk first 10 ingredients in bowl. Add steaks. Cover; chill overnight.\nBring 2 cups water to boil in small saucepan. Add rice and 1 teaspoon salt. Return to boil; reduce heat to low, cover, and cook until water is absorbed, about 18 minutes.\nMeanwhile, prepare barbecue (medium-high heat). Grill steaks until slightly charred but still pink in center, about 3 minutes per side. Transfer to plate. Let stand 5 minutes.\nHeat 2 tablespoons oil in large skillet over medium heat. Add kimchi and vinegar. Stir until heated. Fold in rice. Season with salt and pepper. Keep warm.\nHeat 1 teaspoon oil in large nonstick skillet over medium heat. Crack eggs into skillet, being careful not to break yolk. Sprinkle with salt and pepper. Cook until whites are set, about 3 minutes.\nDivide kimchi rice among 4 plates. Slice steaks thinly across grain; arrange over rice. Top each with egg; sprinkle with green onions and serve.\n*Available in the Asian foods section of some supermarkets and at Japanese markets.",
      "Image": "//20fix.com/xfood/img/steak-and-eggs-korean-style-239793.jpg"
    },
    {
      "id": "10760",
      "Title": "Korean-Style Grilled Flank Steak",
      "Ingredients": {
        "1": "1/4 cup soy sauce",
        "2": "2 tablespoons rice vinegar (not seasoned)",
        "3": "1 tablespoon grated peeled ginger",
        "4": "1 garlic clove, minced",
        "5": "2 teaspoons Sriracha (Southeast Asian chile sauce)",
        "6": "2 teaspoons sugar",
        "7": "1 1/2 teaspoons Asian sesame oil",
        "8": "1 to 1 1/4 pound flank steak",
        "9": "2 scallions, finely chopped",
        "10": "2 tablespoons toasted sesame seeds",
        "11": "Accompaniments: white rice; soft leaf lettuce"
      },
      "Instructions": "Stir together soy sauce, vinegar, ginger, garlic, Sriracha, sugar, and sesame oil.\nPrepare a gas grill for direct-heat cooking over medium-high heat.\nOil grill rack, then grill steak, covered, turning over once, 6 to 8 minutes for medium-rare.\nTransfer steak to a cutting board and drizzle with 2 tablespoons sauce, then let stand, uncovered, 5 minutes. Thinly slice steak across the grain. Serve with remaining sauce, scallions, and sesame seeds.",
      "Image": "//20fix.com/xfood/img/korean-style-grilled-flank-steak-238936.jpg"
    },
    {
      "id": "10876",
      "Title": "Korean Vegetable Rice Bowl",
      "Ingredients": {
        "1": "1 2/3 cups Asian short-grain white or sushi rice",
        "2": "2 cups water",
        "3": "1 (10- to 12-ounce) bunch flat-leaf spinach, stems discarded",
        "4": "1/2 pound fresh soybean or mung-bean sprouts, trimmed",
        "5": "2 large carrots",
        "6": "1 small zucchini, trimmed",
        "7": "1 cup drained preserved fiddlehead fern stems (also called bracken fern, kosari, or warabi; optional)",
        "8": "1/4 cup plus 2 teaspoons vegetable oil",
        "9": "6 ounces fresh shiitake mushrooms, stems discarded and caps cut into very thin slices (2 cups)",
        "10": "6 teaspoons finely chopped garlic (from 4 cloves)",
        "11": "1 1/2 teaspoons salt",
        "12": "1 1/2 teaspoons Asian sesame oil",
        "13": "2 teaspoons sesame seeds, toasted and coarsely chopped",
        "14": "4 large eggs",
        "15": "4 tablespoons Korean hot-pepper paste (sometimes labeled \"gochujang\")",
        "16": "8 (3 1/2 - by 3-inch) sheets toasted nori (dried laver, preferably seasoned), cut into thin strips with scissors",
        "17": "Accompaniments: packaged cabbage kimchi (Korean spicy pickled cabbage) or other vegetable kimchi",
        "18": "an adjustable-blade slicer fitted with julienne blade"
      },
      "Instructions": "Wash rice in several changes of cold water until water is almost clear, then drain in a sieve. Bring rice and water (2 cups) to a boil in a 1 1/2- to 2-quart heavy saucepan, uncovered, then reduce heat to low and cook, covered, until water is absorbed and rice is tender, about 20 minutes. Remove from heat and let stand, covered, 10 minutes, then stir rice from top to bottom. Keep warm, covered.\nWash spinach well and cook in a 4- to 5-quart pot of boiling salted water , stirring, until just wilted, 15 to 30 seconds. Transfer with tongs to a large bowl of ice and cold water to stop cooking, reserving cooking water. Drain spinach and squeeze small handfuls to remove as much moisture as possible. Return spinach-cooking water to a boil, then add bean sprouts and cook, stirring, until just tender, 2 to 3 minutes. Drain in a colander.\nHolding each carrot at a 45-degree angle to slicer, cut carrots into thin (1/8-inch) matchsticks. Cut skin and firm flesh of zucchini lengthwise into long strips using slicer, avoiding center core with seeds (discard core). Rinse and drain fern stems, then cut off and discard any dark or hard pieces. Cut ferns crosswise into 2-inch pieces.\nHeat 2 teaspoons vegetable oil in a 12-inch nonstick skillet over moderately high heat, swirling to coat, until hot but not smoking, then sauté mushrooms, 1 teaspoon garlic, and 1/4 teaspoon salt, stirring, until mushrooms are tender, about 3 minutes. Stir in 1/4 teaspoon sesame oil and transfer to a small bowl. Wipe skillet clean with a paper towel. Working with each vegetable separately, sauté carrots, zucchini, bean sprouts, fern stems, and spinach, each in 2 teaspoons vegetable oil with 1 teaspoon garlic and 1/4 teaspoon salt, in same manner, then stirring in 1/4 teaspoon sesame oil for each. Transfer each vegetable to its own bowl as cooked and season with salt. Stir 1 teaspoon sesame seeds into spinach.\nWipe skillet clean and heat remaining 2 teaspoons vegetable oil over moderate heat until hot but not smoking, then crack eggs into skillet and fry until whites are cooked and yolks begin to set, 4 to 6 minutes.\nDivide rice among 4 shallow bowls, mounding it into a dome. Arrange vegetables on top of rice and place 1 egg on top of each rice bowl. Spoon 1 tablespoon hot-pepper paste over each serving, then sprinkle with nori and remaining teaspoon sesame seeds.",
      "Image": "//20fix.com/xfood/img/korean-vegetable-rice-bowl-238434.jpg"
    },
    {
      "id": "11030",
      "Title": "Korean-Style Short Ribs",
      "Ingredients": {
        "1": "1/4 cup sesame seeds, toasted and cooled completely",
        "2": "1 bunch scallions, trimmed and finely chopped",
        "3": "6 garlic cloves, minced",
        "4": "1/2 cup soy sauce",
        "5": "1/4 cup packed light brown sugar",
        "6": "3 tablespoons gochujang (Korean hot-pepper paste)",
        "7": "1 tablespoon Asian sesame oil",
        "8": "6 pounds beef short ribs or flanken",
        "9": "3 cups water",
        "10": "1 (2-inch) piece peeled fresh ginger, smashed",
        "11": "Accompaniment: kimchi",
        "12": "an electric coffee/spice grinder"
      },
      "Instructions": "Grind sesame seeds to a coarse powder in grinder. Reserve 1/4 cup scallion greens, then whisk together remaining scallions, garlic, soy sauce, brown sugar, hot-pepper paste, sesame oil, and 2 tablespoons sesame-seed powder in a large bowl. Reserve remaining sesame-seed powder for serving. Add short ribs to soy sauce mixture, rubbing mixture into them. Transfer ribs to a large sealable plastic bag and seal bag, pressing out excess air. Marinate, chilled, at least 8 hours.\nTransfer ribs to a wide 6- to 8-quart heavy pot and add water and ginger. Simmer, tightly covered, until ribs are very tender, about 3 hours.\nTransfer ribs to a platter using tongs and keep warm, covered with foil. Skim fat from sauce and pour sauce through a sieve lined with a dampened paper towel into a bowl, then discard solids. Serve ribs with sauce in shallow bowls and sprinkle with reserved scallion greens and remaining sesame-seed powder.",
      "Image": "//20fix.com/xfood/img/korean-style-short-ribs-237655.jpg"
    },
    {
      "id": "11611",
      "Title": "Grilled Halibut, Eggplant, and Baby Bok Choy with Korean Barbecue Sauce",
      "Ingredients": {
        "1": "4 tablespoons olive oil or vegetable oil, divided",
        "2": "2 garlic cloves, minced",
        "3": "1 1/2 teaspoons minced serrano chile with seeds",
        "4": "1/3 cup soy sauce",
        "5": "1/4 cup (packed) dark brown sugar",
        "6": "3 tablespoons unseasoned rice vinegar",
        "7": "3 tablespoons water",
        "8": "1 tablespoon Asian sesame oil",
        "9": "8 baby bok choy, halved lengthwise",
        "10": "4 medium-size Japanese eggplants, trimmed, halved lengthwise",
        "11": "4 6- to 7-ounce halibut fillets (each about 1 inch thick)",
        "12": "2 green onions, thinly sliced"
      },
      "Instructions": "Heat 1 tablespoon olive oil in heavy small saucepan over medium heat. Add garlic and chile; sauté until fragrant and light golden, about 3 minutes. Add soy sauce, brown sugar, vinegar, and 3 tablespoons water and bring to boil, stirring until sugar dissolves. Reduce heat to medium and simmer until mixture is reduced to 3/4 cup, about 5 minutes (sauce will be thin). Remove barbecue sauce from heat; whisk in sesame oil. Transfer 1/4 cup barbecue sauce to small bowl and reserve for serving.\nPrepare barbecue (medium heat). Combine bok choy and eggplant halves in large bowl. Drizzle 2 tablespoons olive oil over and toss to coat. Sprinkle with salt and pepper. Brush fish with remaining 1 tablespoon olive oil; sprinkle with salt and pepper. Grill vegetables and fish until vegetables are tender and slightly charred and fish is just opaque in center, turning occasionally and brushing with sauce, about 10 minutes total for vegetables and 7 minutes total for fish. Transfer vegetables and fish to plates; sprinkle with green onions. Drizzle with reserved sauce and serve.",
      "Image": "//20fix.com/xfood/img/grilled-halibut-eggplant-and-baby-bok-choy-with-korean-barbecue-sauce-235590.jpg"
    },
    {
      "id": "12964",
      "Title": "Korean Pancakes",
      "Ingredients": {
        "1": "3 tablespoons soy sauce",
        "2": "2 teaspoons rice vinegar (not seasoned)",
        "3": "1 tablespoon sesame seeds, toasted",
        "4": "1/4 teaspoon dried hot red pepper flakes",
        "5": "1/4 teaspoon Asian sesame oil",
        "6": "1 cup dried peeled (yellow) mung beans*",
        "7": "2 medium carrots",
        "8": "1 bunch scallions (white and pale green parts only)",
        "9": "1 (5-inch) fresh red chile, thinly sliced crosswise (2 tablespoons), including seeds",
        "10": "1 tablespoon minced garlic (about 3 cloves)",
        "11": "1 cup water",
        "12": "2 large eggs",
        "13": "2 tablespoons all-purpose flour",
        "14": "1 teaspoon salt",
        "15": "4 tablespoons vegetable oil",
        "16": "a Japanese Benriner** or other adjustable-blade slicer"
      },
      "Instructions": "Stir together all dipping-sauce ingredients in a small bowl.\nRinse mung beans in a sieve under cold running water until water runs clear. Cover beans with cold water by 2 inches in a bowl and soak, chilled, at least 2 hours.\nCut carrots into thin matchsticks, preferably using slicer.Halve scallions lengthwise and cut into 2-inch pieces. Combine carrots, scallions, chile, and garlic in a large bowl.\nDrain mung beans and purée with water in a food processor until smooth, about 1 minute. Add eggs, flour, and salt and blend until smooth, about 30 seconds. Pour mixture over vegetables in bowl and stir with a flexible spatula. (Batter will be thick.)\nHeat 1 tablespoon oil in a large heavy nonstick skillet (at least 8 inches across bottom) over moderate heat until hot but not smoking, then swirl to coat. Stir batter, then ladle 1 cup batter into skillet, pressing down lightly with a large spatula to flatten and evenly distribute vegetables, to make an 8-inch pancake (less than 1/2 inch thick). Cook until edges begin to bubble and turn golden, 1 to 2 minutes, then turn over with spatula and cook until other side is golden, 1 to 2 minutes more. Transfer pancake to paper towels to drain. Make 3 more pancakes in same manner, stacking them (after draining briefly) if desired. Transfer pancakes, 1 at a time, to a cutting board and cut each into 6 wedges. Serve warm or at room temperature with dipping sauce.",
      "Image": "//20fix.com/xfood/img/korean-pancakes-230986.jpg"
    }
  ],
  "t": 22,
  "p": {
    "limitstart": 0,
    "limit": 25,
    "total": 22,
    "pagesStart": 1,
    "pagesStop": 1,
    "pagesCurrent": 1,
    "pagesTotal": 1
  }
}